{
  "app": {
    "config": "/home/bjk/src/github.com/bketelsen/svn/settings.json",
    "cwd": "./",
    "src": "./content/",
    "filePattern": "**/*.md",
    "ignore": "*(icon|input)*",
    "dist": "./src/components/content.json",
    "display": true,
    "server": false,
    "port": 3001,
    "name": "markdown-json",
    "metadata": true,
    "version": "1.5.0"
  },
  "data": [
    {
      "id": "posts__ai-ml-documents-one",
      "contents": "<p>In this first post of (likely) a multi-part series I&#39;m going to discuss how I am using machine learning, AI, and good old-fashioned elbow grease to make sense of the 3000 files in my <code>~/Documents/Unfiled</code> directory.</p>\n<!-- more -->\n\n<h3 id=\"the-problem-statement\">The Problem Statement</h3>\n<p>There are several contributing factors to the problem.  Let&#39;s start with the obvious ones:</p>\n<ul>\n<li>I&#39;m a digital packrat</li>\n<li>I&#39;m a single parent of 3 (and therefore busy)</li>\n<li>I can be lazy sometimes</li>\n<li>I have ADHD, and get easily sidetracked from things I intended to do</li>\n</ul>\n<p>When my dad passed away last year, it got even worse.  Suddenly I was getting all of his mail, bills, correspondence, too.  I didn&#39;t want to lose it; but I sure wasn&#39;t ready to read it all.  So I scanned it and dropped it in the <code>Unfiled</code> folder. </p>\n<p>So now we&#39;re here.  Where <code>here</code> is a place where I can&#39;t find anything I need and my <code>Documents</code> directory is the definition of <code>hot-mess</code>.  </p>\n<h3 id=\"the-goal\">The Goal</h3>\n<p>I&#39;d like to take that folder of 3000 random unclassified documents and sort them into something more clear.  I think sorting them by originating source (Supplier, Vendor, Biller, Organization) is a good first step.  Eventually I&#39;d like to sort them by date group too.  Probably by Year, then Month.</p>\n<p>For a bonus, I&#39;d love to do a <a href=\"https://docs.microsoft.com/en-us/windows/win32/projfs/projected-file-system?WT.mc_id=none-twitter-brketels\">projected filesystem</a> sort of thing in Windows and a <a href=\"https://9p.io/wiki/plan9/Installing_a_Plan_9_File_Server/index.html\">Plan9</a> type server on Mac/Linux using FUSE.  It&#39;d be really convenient to be able to get at documents from a Filesystem interface by using different facets like keywords, dates, categories, etc.  That might fit more cleanly with the way I think, too.  But, again, that&#39;s a stretch goal, because we&#39;ll need all that metadata first.</p>\n<p>If you&#39;re old enough to remember <a href=\"https://arstechnica.com/information-technology/2018/07/the-beos-filesystem/\">BeOS Filesystem</a>, it would have solved nearly all of this.  Someday we&#39;ll get back to the database/filesystem mashup that truly needs to exist.</p>\n<h3 id=\"the-solutions\">The Solution(s)</h3>\n<p>First, there isn&#39;t really a one-step solution to this.  It&#39;s going to take some work, and I can likely automate MOST of that.  But there will still be a good portion of things I can&#39;t sort automatically.</p>\n<h4 id=\"step-one\">Step One</h4>\n<p>As a first step, I wrote a small Go program that calls <a href=\"https://cda.ms/126\">Azure Cognitive Services</a> Vision API to do Optical Character Recognition on all the files that are compatible (PDF and image files).  Nearly everything I have is in pdf format, but there are a few TIFF files in there too.  This program is in flux right now, so I&#39;m not going to release it as Open Source until it&#39;s settled a bit.  If I forget - ping me on twitter @bketelsen or email <a href=\"mailto:mail@bjk.fyi\">mail@bjk.fyi</a> - and remind me!  Related: the code samples in this post are probably garbage, and won&#39;t likely match the end result that I publish.  I&#39;m sure I&#39;m swallowing errors, and haven&#39;t done the slightest bit of refactor/cleanup on this code yet.  </p>\n<blockquote>\n<p>WARNING: <em>Don&#39;t cut/paste this code yet, please.</em></p>\n</blockquote>\n<p>I created a domain type appropriately called <code>Document</code> that stores metadata about files on disk:</p>\n<pre><code class=\"language-go\">type Document struct {\n    Hash         string\n    Path         string\n    PreviousPath string\n    Operation    *CognitiveOperation\n    Results      *CognitiveReadResponse\n}</code></pre>\n<p>I&#39;ll discuss the fields as they come up, but <code>Path</code> and <code>PreviousPath</code> should be obvious.  Current and previous location on disk, so that I can account for file moves with at least a little bit of history.</p>\n<p>The pricing for the OCR is really attractive - as of September, 2019 it is:</p>\n<blockquote>\n<p>0-1M transactions — $1.50 per 1,000 transactions</p>\n</blockquote>\n<p>I know that I&#39;ll be fine tuning the processes that run, and likely running them repeatedly.  I wanted to find a way to store the results from the OCR for each document, but I am also aware that I can&#39;t use the document name and path as the canonical key to find the document later, because the goal of this app is to move them and rename them appropriately!  So I decided to use a hash of the file contents as a key.  <code>SHA256</code> seems to be the right algorithm for file contents, low cost computation, low collision chance.  So I created a hash function that calculates the <code>SHA256</code> hash of the document after it is read:</p>\n<pre><code class=\"language-go\">func (d *Document) GetHash() {\n\n    f, err := os.Open(d.Path)\n    if err != nil {\n        log.Fatal(err)\n    }\n    defer f.Close()\n\n    h := sha256.New()\n    if _, err := io.Copy(h, f); err != nil {\n        log.Fatal(err)\n    }\n    d.Hash = fmt.Sprintf(&quot;%x&quot;, h.Sum(nil))\n}</code></pre>\n<p>After getting the results of the OCR operation, I set them in the <code>Document</code> type, then persist the metadata to disk in a hidden directory.  Currently that&#39;s <code>~/.classifier/</code> but, as with all of this, it might change in the future.</p>\n<p>The file is stored using the <code>SHA256</code> hash of the contents as the file name, and the <code>Document</code> type is serialized to disk using Go&#39;s efficient and lightweight <code>encoding/gob</code> format.  While I&#39;m debugging and playing with this code, I decided to also persist the data in <code>json</code> format so it&#39;s easier to read.  Here&#39;s the method on <code>Document</code> that saves/serializes to disk:</p>\n<pre><code class=\"language-go\">func (d *Document) SaveMetadata() error {\n  fmt.Println(d.Hash)\n  //TODO use new XDG config dir location\n  // https://tip.golang.org/pkg/os/#UserConfigDir\n    filePath := &quot;/home/bjk/.classifier/&quot; + d.Hash // TODO FILEPATH.JOIN\n    fmt.Println(filePath)\n    file, err := os.OpenFile(filePath, os.O_TRUNC|os.O_CREATE|os.O_WRONLY, 0644)\n    if err != nil {\n        return err\n    }\n    defer file.Close()\n    enc := gob.NewEncoder(file)\n    err = enc.Encode(d)\n    if err != nil {\n        return err\n    }\n    jfilePath := &quot;/home/bjk/.classifier/&quot; + d.Hash + &quot;.json&quot; // TODO FILEPATH.JOIN\n    fmt.Println(jfilePath)\n    jfile, err := os.OpenFile(jfilePath, os.O_TRUNC|os.O_CREATE|os.O_WRONLY, 0644)\n    if err != nil {\n        return err\n    }\n    defer jfile.Close()\n    jenc := json.NewEncoder(jfile)\n    return jenc.Encode(d)\n}</code></pre>\n<p>Lots of bad things happening in there, see above caveats about copying/pasting this code.   The important part is the encoding in <code>gob</code> format of the contents of the <code>Document</code> metadata, which is then saved to disk using the <code>SHA256</code> hash as the filename.  This is a nice future-proof solution, and provides several benefits.</p>\n<ul>\n<li>If there is already a file with the same name, it&#39;s been processed once.</li>\n<li>If the <code>.Path</code> is different from the document I&#39;m inspecting, I might have an exact duplicate, which is a candidate for (soft) deleting</li>\n<li>It doesn&#39;t matter where the files get moved, as long as the <code>SHA256</code> hash matches, I&#39;ve got the metadata saved already.</li>\n</ul>\n<p>This is a very low-tech metadata database, of sorts.  It&#39;s definitely not optimized for real-time use, but instead for batch operations.</p>\n<p>Keeping all the metadata in this format means I can write any number of other tools to read and modify the metadata without worrying too much. </p>\n<h3 id=\"step-two\">Step Two</h3>\n<p>At this point, I have a directory full of unprocessed files and a way to process them once and save the results so I don&#39;t have to re-process them later.  It&#39;s time to fire off the processing app.  I used <a href=\"https://github.com/spf13/cobra\">cobra</a> to build the command-line utility, so I made the root/naked command do the actual calls to Azure Cognitive Services:</p>\n<pre><code class=\"language-bash\">go build\n./classifier</code></pre>\n<p>This iterates over every file in the <code>~/Documents/Unfiled</code> directory, calling Cognitive Services OCR for the file types that are supported.  There is no current mechanism to retrieve metadata from other document types (Word documents, text files, etc).  That&#39;s a future addition.</p>\n<p>After receiving the results, the responses are serialized using the above mentioned <code>gob</code> serialization into <code>~/.classifier/HASH</code></p>\n<h3 id=\"classification\">Classification</h3>\n<p>Based on the results there are some simple <code>bag of words</code> matches that can be done.  Some of the documents I have contain very unique text that is indicative of a particular document type.  For example, Bank of America always includes my account number and their address in <code>Wilmington</code>.  No other document in my corpus has those two distinct things together, so I can write a simple classifier for all Bank of America documents.  I decided to use simple TOML for a configuration file here:</p>\n<pre><code>[[entity]]\nname = &quot;Bank of America&quot;\ndirectory = &quot;BOA&quot;\nkeywords = [&quot;Bank of America&quot;,&quot;12345677889&quot;,&quot;Wilmington&quot;]</code></pre><p>Here, I added a sub-command in <code>cobra</code> so I can classify files without re-posting them to Cognitive Services.  So I added the <code>classifier process</code> command:</p>\n<pre><code class=\"language-bash\">./classifier process</code></pre>\n<p>It currently goes through all the files in <code>Unfiled</code> and checks their metadata for matches against the TOML file.   This worked perfectly for several of my external correspondents.  It took all the documents from <code>Unfiled</code> and placed them in <code>Filed/{directory}</code>.</p>\n<h3 id=\"what-about-the-rest\">What About The Rest?</h3>\n<p>There are many documents that aren&#39;t easily processed this way though.  My next inspiration came in the shower (of course).  If you squint enough, or are far enough away, all documents from the same entity of the same type look the same.  So all my mortgage statements look the same, but the numbers are different.</p>\n<p>I installed ImageMagick, and wrote a script to make a low-resolution thumbnail of each PDF.  I made the resolution low enough that the text isn&#39;t readable even if you magnify the image.</p>\n<p>Then I searched for ways to compare images and came across <a href=\"https://github.com/rivo/duplo\">duplo</a>, which appears to do what I need.  It does a hash of the image and allows you to compare other documents to that hash to find a similarity score.  Using this type of process my next goal is to group similar documents together by searching for ones with matching or close-to-matching image hashes.  </p>\n<p>But that&#39;ll be probably next weekend.   It&#39;s been really fun doing this much, and I&#39;m looking forward to seeing how much more I can learn as I go!</p>\n<p>Intermediate results:</p>\n<p>Before:</p>\n<pre><code class=\"language-bash\">2846 Files</code></pre>\n<p>After:</p>\n<pre><code class=\"language-bash\">Unfiled\\\n  2710 Files\nFiled\\\n  136 Files in 2 Directories</code></pre>\n",
      "title": "Organizing Documents with Some AI, ML, and Elbow Grease",
      "layout": "post",
      "date": "2019-09-03",
      "slug": "ai-ml-documents-one",
      "images": [
        "/images/IGa3Md8wP6g.jpg"
      ],
      "thumbnail": "/images/IGa3Md8wP6g-thumb.jpg",
      "credit": "https://unsplash.com/photos/IGa3Md8wP6g",
      "description": "Organizing my loose documents with some machine learning, cognitive services, and elbow grease.",
      "tags": [
        "ai",
        "ml"
      ],
      "classes": [
        "feature-hyphenate",
        "feature-justify",
        "feature-highlight"
      ],
      "categories": [
        "Linux",
        "Azure"
      ],
      "excerpt": "<p>In this first post of (likely) a multi-part series I&apos;m going to discuss how I am using machine learning, AI, and good old-fashioned elbow grease to make sense of the 3000 files in my <code>~/Documents/Unfiled</code> directory.</p>",
      "meta": {
        "relativePath": "posts/ai-ml-documents-one.html",
        "createdAt": "2020-11-04T22:03:00.350Z",
        "lastModified": "2020-11-04T22:03:00.350Z",
        "size": 10494,
        "formattedSize": "10.2 KB"
      }
    },
    {
      "id": "posts__azure-devops-ci-setup",
      "contents": "<p>Microsoft just announced a killer continuous integration setup for Github, and I was really anxious to give it a try.  This post documents my setup for an <a href=\"https://github.com/gophersnacks/site\">Elixir/Phoenix application</a> I&#39;m building with <a href=\"https://twitter.com/arschles\">Aaron Schlesinger</a>.</p>\n<!-- more -->\n\n<h3 id=\"set-up-azure-pipelines\">Set Up Azure Pipelines</h3>\n<p>Step one is to head to the <a href=\"https://github.com/marketplace/azure-pipelines\">Github Marketplace</a> and install the Azure Pipelines service.</p>\n<p><img src=\"/images/2018/09/Screen-Shot-2018-09-11-at-9.42.48-AM.png\" alt=\"Azure Pipelines on Github\"></p>\n<p>I clicked on the &quot;Set up a plan&quot; button, and then selected the Free option, and &quot;Install it for free&quot; link.  This allows Linux, Mac and Windows build machines, with 10 free parallel jobs.  That&#39;s plenty for most open source projects.</p>\n<p><img src=\"/images/2018/09/Screen-Shot-2018-09-11-at-9.43.08-AM.png\" alt=\"Confirmation Dialog\"></p>\n<p>Next I confirmed the Marketplace change by choosing the &quot;Complete order and begin installation&quot; button.</p>\n<p><img src=\"/images/2018/09/Screen-Shot-2018-09-11-at-9.43.26-AM.png\" alt=\"Review Order\"></p>\n<p>After authentication with my Azure account, I needed to create a Project.  Projects in Azure DevOps are conceptual containers that host a single repository and it&#39;s build procedures.</p>\n<p><img src=\"/images/2018/09/Screen-Shot-2018-09-11-at-9.45.52-AM.png\" alt=\"Setup Project\"></p>\n<p>After creating the project, I needed to pick a repository:</p>\n<p><img src=\"/images/2018/09/Screen-Shot-2018-09-11-at-9.46.37-AM.png\" alt=\"Choose A Repository\"></p>\n<h3 id=\"configuration\">Configuration</h3>\n<p>The Azure DevOps pipeline wizard suggested a Docker pipeline for this Elixir project, which suits me fine.  We had already created appropriate Dockerfile and docker-compose.yml files.  The last step was to create an azure-pipelines.yml file and put it in the root of the repository.</p>\n<pre><code class=\"language-javascript\"># Docker image\n# Build a Docker image to run, deploy, or push to a container registry.\n# Add steps that use Docker Compose, tag images, push to a registry, run an image, and more:\n# https://docs.microsoft.com/vsts/pipelines/languages/docker\n\npool:\n  vmImage: &#39;Ubuntu 16.04&#39;\n\nvariables:\n  imageName: &#39;gophersnacks:$(build.buildId)&#39;\n\nsteps:\n- script: |\n    docker-compose -p site up -d\n    docker build --network=site_default --build-arg MIX_ENV=test -f Dockerfile.test .\n    docker-compose down\n  displayName: &#39;test&#39;\n- script: docker build -f Dockerfile -t $(imageName) .\n  displayName: &#39;docker build&#39;</code></pre>\n<p> After some experimentation I created two steps in my pipeline, the first runs tests, and the second builds the Docker container for production usage.  As is the case every time I create a new CI environment, it took 40 commits to get the Docker networking and database configuration setup right.  Eventually, though, I succeeded:</p>\n<p> <img src=\"/images/2018/09/Screen-Shot-2018-09-11-at-9.58.52-AM.png\" alt=\"FAIL\"></p>\n<p> These results were correct; I hadn&#39;t updated the tests since adding authentication to the web app yesterday.  <em>So I did what any good developer would do – I deleted the failing tests.</em>  Just temporarily, of course, because I wanted to focus my time on configuring Azure Pipelines, not learning how to test authenticated HTTP requests in Phoenix.</p>\n<h3 id=\"conclusion\">Conclusion</h3>\n<p>The process to set up Azure DevOps Pipelines was really simple, and mostly involved clicking on a series of green buttons and integrating the Docker setup we had already created.  I was impressed by the speed of the builds after I pushed my commits to Github.  I think we have a winner with the new DevOps releases.  You can find the documentation on <a href=\"https://cda.ms/F8\">docs.microsoft.com</a>.</p>\n<p>In future posts, we&#39;ll get this Pipeline configured to push to a Kubernetes cluster to add Continuous Deployment to this application.</p>\n",
      "title": "Azure DevOps CI Setup",
      "layout": "post",
      "date": "2018-09-11",
      "slug": "azure-devops-ci-setup",
      "images": [
        "/img/unsplash-photos-QRkew0KwXSM.jpg"
      ],
      "thumbnail": "/img/unsplash-photos-QRkew0KwXSM.tn-500x500.jpg",
      "credit": "https://unsplash.com/photos/QRkew0KwXSM",
      "description": "Setting up CI on Azure DevOps",
      "tags": [
        "elixir",
        "ci"
      ],
      "classes": [
        "feature-hyphenate",
        "feature-justify",
        "feature-highlight"
      ],
      "categories": [
        "CI",
        "Azure"
      ],
      "excerpt": "<p>Microsoft just announced a killer continuous integration setup for Github, and I was really anxious to give it a try.  This post documents my setup for an <a href=\"https://github.com/gophersnacks/site\">Elixir/Phoenix application</a> I&apos;m building with <a href=\"https://twitter.com/arschles\">Aaron Schlesinger</a>.</p>",
      "meta": {
        "relativePath": "posts/azure-devops-ci-setup.html",
        "createdAt": "2020-11-05T00:06:34.000Z",
        "lastModified": "2020-11-05T00:06:34.000Z",
        "size": 4103,
        "formattedSize": "4.0 KB"
      }
    },
    {
      "id": "posts__arrested-devops-appearance-on-krustlet",
      "contents": "<p>I had a great time on the Arrested DevOps podcast with Bridget Kromhout.\nWe chatted along with Taylor Thomas of the Deis team about <a href=\"https://github.com/deislabs/krustlet\">krustlet</a>.</p>\n<!-- more -->\n\n\n<h2 id=\"krustlet-on-arrested-devops\">Krustlet on Arrested DevOps</h2>\n<p>You can <a href=\"https://www.arresteddevops.com/krustlet/\">listen here</a> or find it in all the usual podcast places, like Spotify and iTunes.</p>\n",
      "title": "Arrested DevOps Appearance on Krustlet",
      "layout": "post",
      "date": "2020-04-14",
      "slug": "arrested-devops-appearance-on-krustlet",
      "images": [
        "/images/b2iviaMJtoU.jpg"
      ],
      "thumbnail": "/images/b2iviaMJtoU-thumb.jpg",
      "credit": "https://unsplash.com/photos/b2iviaMJtoU",
      "description": "Podcast about Rust, Kubernetes, and Web Assembly",
      "tags": [
        "rust",
        "wasm",
        "podcast",
        "kubernetes"
      ],
      "classes": [
        "feature-hyphenate",
        "feature-justify",
        "feature-highlight"
      ],
      "categories": [
        "Linux",
        "Windows",
        "Open Source",
        "Web Assembly"
      ],
      "excerpt": "<p>I had a great time on the Arrested DevOps podcast with Bridget Kromhout.\nWe chatted along with Taylor Thomas of the Deis team about <a href=\"https://github.com/deislabs/krustlet\">krustlet</a>.</p>",
      "meta": {
        "relativePath": "posts/arrested-devops-appearance-on-krustlet.html",
        "createdAt": "2020-11-05T00:06:20.870Z",
        "lastModified": "2020-11-05T00:06:20.870Z",
        "size": 874,
        "formattedSize": "874 Bytes"
      }
    },
    {
      "id": "posts__byobu-wsl",
      "contents": "<p><a href=\"http://byobu.co/\">Byobu</a> is a frontend for <code>tmux</code> and <code>screen</code> that allows you to save your terminal sessions and reconnect to them easily.  It&#39;s one of the biggest time-savers in my bag of tricks.  Read along to learn how I use it.  This article applies to any *nix-like system, despite the &quot;on WSL&quot; in the title.</p>\n<!-- more -->\n\n<h3 id=\"installing\">Installing</h3>\n<p>You can install Byobu on nearly any *nix-like operating system.  Since I&#39;m using Ubuntu and Debian, I&#39;ll use <code>apt</code> to install the version that is shipped with the OS:</p>\n<p>{{&lt; figure src=&quot;/images/byobucheck.png&quot; alt=&quot;Check for byobu binary&quot; position=&quot;center&quot; caption=&quot;Check to see if byobu is installed&quot; &gt;}}</p>\n<p>Once installed it&#39;s easy to start a session, just type the <code>byobu</code> command:\n{{&lt; figure src=&quot;/images/byobuopen.png&quot; alt=&quot;new session&quot; position=&quot;center&quot; caption=&quot;A new Byobu session&quot; &gt;}}</p>\n<h3 id=\"enabling\">Enabling</h3>\n<p>You can continue to use <code>byobu</code> this way, manually, but the real power of <code>byobu</code> comes by enabling login/ssh integration.  From your shell prompt, type the command <code>byobu-enable</code>.  This will enable a wrapper script that wraps your login session with a <code>byobu</code> session.  You can disable this with <code>byobu-disable</code>.</p>\n<p>With <code>byobu</code> in &quot;enabled&quot; mode, every time I open a terminal it drops me into either an existing <code>byobu</code> session if one exists, or creates a new one for me.  It&#39;s a delightful way to resume where I left off without having to worry about whether I started a <code>tmux</code> session.</p>\n<h3 id=\"usage\">Usage</h3>\n<p>In stark contrast to <code>tmux</code> and <code>screen</code>, <code>byobu</code> is pretty easy to use.  By default it uses mostly function keys to manage your session.  In the background, <code>byobu</code> issues appropriate commands to <code>tmux</code> or <code>screen</code> on your behalf, so you don&#39;t have to remember those crazy control sequences.</p>\n<h4 id=\"windows\">Windows</h4>\n<p>Once inside a <code>byobu</code> session, you can create multiple windows inside your terminal session.  If you&#39;ve used a terminal client that supports tabs, this isn&#39;t much different.  The benefit is that your windows are persisted with your session.  So you can exit and resume your session with all your windows intact.</p>\n<p>{{&lt; figure src=&quot;/images/byobunvim.png&quot; alt=&quot;a single byobu window&quot; position=&quot;center&quot; caption=&quot;A single byobu window&quot; &gt;}}</p>\n<p>Windows are labeled with a number in the status bar at the bottom of the screen.  Press <code>F2</code> to open a new window and you should see a second terminal appear:</p>\n<p>{{&lt; figure src=&quot;/images/byobuwin.png&quot; alt=&quot;a second byobu window&quot; position=&quot;center&quot; caption=&quot;A second byobu window&quot; &gt;}}</p>\n<p>Now I have two windows open, labeled <code>0:neovim</code> and <code>1:</code> in the taskbar.  I skipped a step here and renamed my original window so I wouldn&#39;t get lost when I add more than one.  Press <code>F8</code> to rename a window.  Note that the window name is just for decoration, it doesn&#39;t relate to running processes at all.</p>\n<p>To navigate between your windows, use <code>F3</code> and <code>F4</code> for previous and next windows.</p>\n<h4 id=\"splits\">Splits</h4>\n<p>Sometimes, I like to have two different terminal applications running in one window.  For example, when editing this blog:</p>\n<p>{{&lt; figure src=&quot;/images/byobusplit.png&quot; alt=&quot;a second byobu window&quot; position=&quot;center&quot; caption=&quot;A second byobu window&quot; &gt;}}</p>\n<p>The top part of the split has <code>neovim</code> editing the content of this post.  The bottom part of the split is the output of <code>hugo</code> as it watches the content directory.</p>\n<p>Create a split by using <code>Shift F2</code> and <code>Control F2</code> for horizontal and vertical splits, respectively.</p>\n<p>I can change back and forth between splits using <code>Shift + F3</code> and <code>Shift + F4</code>.  That&#39;s easy to remember, because it&#39;s just adding <code>Shift</code> to the keys I use to change windows.</p>\n<p>Resizing splits is accomplished with <code>Shift + Alt + [arrow key]</code></p>\n<h4 id=\"closing-the-terminal\">Closing the Terminal</h4>\n<p>When I&#39;m done working in the terminal, but not finished with a particular task, I use <code>F6</code> to detach from the <code>byobu</code> session.  This closes the active terminal window, but keeps <code>byobu</code> and all my windows running in the background.  Reoping my terminal window automatically re-attaches me to my <code>byobu</code> session as if I had never left.</p>\n<h3 id=\"reference--links\">Reference / Links</h3>\n<p>Adding <code>byobu</code> to my toolbelt drastically cut the amount of time it takes to engage with a project I need to walk away from. I have a hard time guessing, but I think I&#39;m saving an hour or more per week at a minimum.  That&#39;s a lot of time.</p>\n<ul>\n<li><a href=\"https://help.ubuntu.com/community/Byobu\">Ubuntu Wiki: Byobu</a></li>\n<li><a href=\"http://byobu.co/documentation.html\">Byobu Documentation</a></li>\n</ul>\n",
      "title": "Byobu on WSL",
      "layout": "post",
      "date": "2019-10-09",
      "slug": "byobu-wsl",
      "images": [
        "/images/mbLr6NEatMI.jpg"
      ],
      "thumbnail": "/images/mbLr6NEatMI-thumb.jpg",
      "credit": "https://unsplash.com/photos/mbLr6NEatMI",
      "description": "Make your life easier with Byobu",
      "tags": [
        "terminal",
        "development"
      ],
      "classes": [
        "feature-hyphenate",
        "feature-justify",
        "feature-highlight"
      ],
      "categories": [
        "Development"
      ],
      "excerpt": "<p><a href=\"http://byobu.co/\">Byobu</a> is a frontend for <code>tmux</code> and <code>screen</code> that allows you to save your terminal sessions and reconnect to them easily.  It&apos;s one of the biggest time-savers in my bag of tricks.  Read along to learn how I use it.  This article applies to any *nix-like system, despite the &quot;on WSL&quot; in the title.</p>",
      "meta": {
        "relativePath": "posts/byobu-wsl.html",
        "createdAt": "2020-11-05T00:06:45.500Z",
        "lastModified": "2020-11-05T00:06:45.500Z",
        "size": 4774,
        "formattedSize": "4.7 KB"
      }
    },
    {
      "id": "posts__career-2-0-go-training-videos-speaking",
      "contents": "<p>A week ago I decided to start a new journey.  While I truly enjoyed working with Blake Mizerany and the team at <a href=\"http://backplane.io\">backplane</a>, I felt I really had a passion for training and growing the Go community and I decided I owe it to myself to pursue it.</p>\n<!-- more -->\n<h3 id=\"flashback-gophercon-2016\">Flashback: GopherCon 2016</h3>\n<p>I taught a one day workshop at GopherCon - Building HTTP APIs in Go - and I really enjoyed the experience.  Putting together the class was a lot of fun, and I got a lot of very positive feedback from the people in the class.  I&#39;ve done corporate training in the past and I had forgotten how much fun it is.  As the feedback from the class started coming in, it occured to me that this might be the solution to a problem I&#39;ve had for three years now.</p>\n<h3 id=\"the-conference-organizers-dilemma\">The Conference Organizer&#39;s Dilemma</h3>\n<p>Running a technical conference takes a tremendous toll on a person.  It&#39;s at least a full-time job for the several months leading up to the conference.  But for all three years I&#39;ve been co-organizing GopherCon with Erik St. Martin I&#39;ve had a full time job to pay the bills.  We run GopherCon lean so the cost to attend is as low as possible -- that means it&#39;s never going to be something I can use to replace the income of a &quot;day job&quot;.  We&#39;ve talked about it several times, and we&#39;re not interested in raising the prices to turn GopherCon into a profit-making enterprise.  GopherCon is about the community, and even though attending a conference is never cheap we don&#39;t want to make the ticket price any higher than it has to be to pay the bills.  The challenge for both of us has been to juggle full time jobs while organizing a conference and still having families that need our time and attention too.</p>\n<h3 id=\"the-solution\">The Solution</h3>\n<p>It didn&#39;t take me long to realize that I can&#39;t continue at this burnout rate. I love the Go community, and helping to foster its growth is one of the places in my life where I get the most satisfaction.  The logical conclusion for me is to adjust my career to match the things in my life that are important.  So today I&#39;m announcing Brian Ketelsen 2.0.  I&#39;ve aligned my work life with the needs of my family, my abilities, and my passion for the Go community.  I have a four pronged plan for paying the bills.</p>\n<h4 id=\"consulting\">Consulting</h4>\n<p>I&#39;m available for short term and project based <a href=\"https://brianketelsen.com/consulting/\">consulting</a>.  Get in touch if you need some help with a stubborn project or just want to do some staff augmentation.  Details are in the &quot;Consulting&quot; link in the menu above.</p>\n<h4 id=\"online-training\">Online Training</h4>\n<p>I&#39;ve started an <a href=\"http://learn.brianketelsen.com\">online learning center</a> where my first course is available to purchase.  It&#39;s a deep dive into the amazing <code>goa</code> code generation framework for building APIs in Go.  The course isn&#39;t complete yet, but if you <a href=\"http://learn.brianketelsen.com/courses/master-api-development-with-goa?product_id=140234&amp;coupon_code=GOAVIDEO\">buy it now</a> you&#39;ll get a great discounted rate and you can follow along as new lessons are released.  The <code>goa</code> class is the first of many.  Some will be free, but most will be inexpensive like this first one.  If you have ideas for topics you want me to cover, I&#39;d love your feedback.  I plan to cover topics including:</p>\n<ul>\n<li>Microservices</li>\n<li>Distributed Applications / Coordination (Go focused)</li>\n<li>Testing (Go focused)</li>\n<li>Containers and Orchestration (Kubernetes, Rancher, Docker)</li>\n</ul>\n<p>I hope that these courses fill a gap in the learning materials available today.  Most of the learning materials available aren&#39;t very specific and don&#39;t dive deep enough into a topic to be of much immediate value.  These courses won&#39;t be generalized, but specific and detailed classes that you can put to use right away.</p>\n<h4 id=\"in-person-training\">In Person Training</h4>\n<p>I&#39;ve also partnered with <a href=\"http://oreilly.com\">O&#39;Reilly</a> to offer in-person training classes in Boston and San Francisco.  You&#39;ll see more specific details with dates and registration information as soon as we&#39;ve ironed out the schedules.  </p>\n<h4 id=\"corporate-training\">Corporate Training</h4>\n<p>Finally, I&#39;m booking corporate training classes for teams that want to learn about Go, Distributed Computing, and Orchestration technologies.  I&#39;ve got several companies lined up already and I&#39;m very excited to share my <a href=\"/about/experience\">experience</a>.  If your team is looking to level-up on Go, Docker, or Kubernetes shoot me an <a href=\"me@brianketelsen.com\">email</a> and get on the schedule!</p>\n<h4 id=\"availability\">Availability</h4>\n<p>Here&#39;s my calendar for the next several months:</p>\n<ul>\n<li>August 17-21 - Speaking at Abstractions.io in Pittsburgh</li>\n<li>August 22-26 - Training Booked!</li>\n<li>August 29 - September 2 - Consulting Booked!</li>\n<li>September 5-9 - Training Booked!</li>\n<li>September 12-16 - <em>Available for Training</em></li>\n<li>September 19-23 - Training Booked!</li>\n<li>September 26-30 - Training Booked!</li>\n<li>October 3-7 - O&#39;Reilly in Boston </li>\n<li>October 24-28 - Training Booked!</li>\n<li>October 31 - November 4 - O&#39;Reilly in San Francisco</li>\n<li>November 5 - November 30 - <em>Available for Training</em></li>\n<li>December - <em>Available for Training</em></li>\n</ul>\n<p>You can stay informed about my upcoming classes, events, trainings and speaking engagements by signing up for my newsletter in the footer down below. Thank you to everyone who provided much-needed advice as I considered this transition.  I hope you&#39;ll come along with me for the ride -- I&#39;m excited that I&#39;ve finally found a solution to the Conference Organizer&#39;s Dilemma. </p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "speaking",
        "training"
      ],
      "date": "2016-06-18T23:10:00Z",
      "description": "",
      "slug": "caddy-hugo-encrypt",
      "images": [
        "https://images.unsplash.com/photo-1492538368677-f6e0afe31dcc?ixlib=rb-0.3.5&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=1080&fit=max&s=de2dfaa06cf1c7b3d2ab7fac089a67bc"
      ],
      "aliases": [
        "/career-2-0-go-training-videos-speaking"
      ],
      "tags": [
        "speaking",
        "training"
      ],
      "title": "Career 2.0 - Go Training, Videos, Speaking",
      "excerpt": "<p>A week ago I decided to start a new journey.  While I truly enjoyed working with Blake Mizerany and the team at <a href=\"http://backplane.io\">backplane</a>, I felt I really had a passion for training and growing the Go community and I decided I owe it to myself to pursue it.</p>",
      "meta": {
        "relativePath": "posts/career-2-0-go-training-videos-speaking.html",
        "createdAt": "2020-11-05T00:07:09.900Z",
        "lastModified": "2020-11-05T00:07:09.900Z",
        "size": 5803,
        "formattedSize": "5.7 KB"
      }
    },
    {
      "id": "posts__eggbites",
      "contents": "<p>This post is a change from the usual technical content.  I made my own Egg Bites this morning, inspired by the delicious ones I like to get at Starbucks.</p>\n<!-- more -->\n\n<p><img src=\"/images/eggbites.jpeg\" alt=\"Finshed Product\"></p>\n<h3 id=\"recipe\">Recipe</h3>\n<p>Prep: </p>\n<ul>\n<li>Preheat your oven to 325 Fahrenheit</li>\n</ul>\n<p>Ingredients:</p>\n<ul>\n<li>Eggs</li>\n<li>Cheese</li>\n<li>Bacon</li>\n</ul>\n<p>Also Need:</p>\n<ul>\n<li>Muffin Pan</li>\n<li>Vegetable Spray</li>\n</ul>\n<p>Directions:</p>\n<ol>\n<li>I started by cutting a vertical slice off a new rasher of bacon so I had a dozen 2 inch pieces of bacon.  I fried up the bacon until it was pretty crispy, then drained it and blotted it to get as much of the grease off of it as possible.</li>\n<li>Then, I sprayed a muffin pan made for pretty decent sized muffins with vegetable spray to prevent sticking.</li>\n<li>Next, I coated the bottom of the muffin pan with shredded cheddar cheese.</li>\n<li>I placed a few pieces of bacon on top of the shredded cheese.</li>\n<li>Next I whipped eggs in a bowl, then poured them over the cheese/bacon in the muffin pans.  I filled the muffin pan roughly 2/3 full.  That was about 2 eggs per muffin slot.  This will vary based on your muffin pan size.</li>\n<li>Finally, I sprinkled more cheese on top.</li>\n</ol>\n<p>I baked them for 12 minutes initially, they weren&#39;t done.  So I added another 6, then another 2 minutes.  It ended up being perfect at 20 minutes.  Your mileage will vary based on your oven, and the size of muffin pan.</p>\n<p>Next I&#39;ll vary the ingredients.  Keep in mind they&#39;ll get soggy if you add wet ingredients (I&#39;m specifically thinking of things like red and green peppers which hold a lot of water).  Lots of different combinations sound delicious, and they seem to be keeping well in the refridgerator.  Delicious!</p>\n",
      "title": "Egg Bites",
      "layout": "post",
      "date": "2019-09-13",
      "slug": "eggbites",
      "images": [
        "/images/eggbites.jpeg"
      ],
      "description": "Quick Recipe for a home-made version of Starbucks Sous-vide Egg Bites",
      "tags": [
        "eggs",
        "recipe"
      ],
      "classes": [
        "feature-hyphenate",
        "feature-justify",
        "feature-highlight"
      ],
      "categories": [
        "Recipes"
      ],
      "excerpt": "<p>This post is a change from the usual technical content.  I made my own Egg Bites this morning, inspired by the delicious ones I like to get at Starbucks.</p>",
      "meta": {
        "relativePath": "posts/eggbites.html",
        "createdAt": "2020-11-05T00:07:21.540Z",
        "lastModified": "2020-11-05T00:07:21.540Z",
        "size": 1962,
        "formattedSize": "1.9 KB"
      }
    },
    {
      "id": "posts__errgroup",
      "contents": "<p>In this article for O&#39;Reilly I explore the new sync.ErrGroup package.</p>\n<!-- more -->\n\n\n<p><a href=\"https://www.oreilly.com/learning/run-strikingly-fast-parallel-file-searches-in-go-with-sync-errgroup\">Article</a>\n<a href=\"https://github.com/bketelsen/gogrep\">Source Code</a></p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "go",
        "errors",
        "concurrency"
      ],
      "date": "2016-09-19T22:53:00Z",
      "description": "",
      "slug": "errgroup",
      "images": [
        "https://images.unsplash.com/photo-1495573258723-2c7be7a646ce?ixlib=rb-0.3.5&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=1080&fit=max&s=5942ab1aa61891b3745a4d63e0b7da5f"
      ],
      "aliases": [
        "/errgroup"
      ],
      "tags": [
        "go",
        "errors",
        "concurrency"
      ],
      "title": "sync.ErrGroup",
      "excerpt": "<p>In this article for O&apos;Reilly I explore the new sync.ErrGroup package.</p>",
      "meta": {
        "relativePath": "posts/errgroup.html",
        "createdAt": "2020-11-05T00:07:30.310Z",
        "lastModified": "2020-11-05T00:07:30.310Z",
        "size": 676,
        "formattedSize": "676 Bytes"
      }
    },
    {
      "id": "posts__getting-crazy-with-windows-subsystem-for-linux",
      "contents": "<p>Lately I&#39;ve been on a <a href=\"https://blog.gopheracademy.com/advent-2017/repeatable-isolated-dev-environments/\">mission</a> to separate my development environments by project, and by category (personal/work/Gophercon/etc).  The writeup on the Gopheracademy blog describes a fun way to create an isolated container-based environment for each project by using LXD on Ubuntu.</p>\n<!-- more -->\n\n<p>Last night I wondered to myself if there was a way to get a similar experience by manipulating <a href=\"https://docs.microsoft.com/en-us/windows/wsl/faq\">Windows Subsystem for Linux</a> somehow.  That was a rabbit hole of searching, let me tell ya true.</p>\n<p>Since the <a href=\"http://www.zdnet.com/article/windows-subsystem-for-linux-graduates-in-windows-10-fall-creators-update/\">Fall Creator&#39;s Update</a> WSL has had more than one distribution available to install.  You can install SUSE, Ubuntu, and soon Fedora.  So deep down in my soul, I KNOW that I can have multiple copies of Ubuntu running with separate filesystems.  That would reproduce the LXD environments I created in Linux.</p>\n<p>After some research, it turns out that the WSL management API is available in the Windows SDK, and several projects already take advantage of this fact.  First I found <a href=\"https://github.com/yuk7/WSL-DistroLauncher\">this one</a> which allows you to do a lot of work and install any Linux distro you want.  I knew I was on the right track.  My next big find was <a href=\"https://github.com/DDoSolitary/LxRunOffline\">LxRunOffline</a> which was built to allow you to install WSL without being online.  It also has the secondary ability to let you install any number of WSL instances.  Now we&#39;re cooking with gas!</p>\n<p>I downloaded <code>LxRunOffline</code> and read the <a href=\"https://github.com/DDoSolitary/LxRunOffline/wiki/Ubuntu\">wiki</a>, which has links to the Ubuntu root filesystem that is installed during a regular WSL install.  Following their instructions, I downloaded the rootfs, put it next to the <code>LxRunOffline</code> binary, and installed <em>another</em> copy of Ubuntu as a new WSL instance.  </p>\n<pre><code>LxRunOffline 2.1.1\nCopyright (C) 2017 DDoSolitary\n\nERROR(S):\n  No verb selected.\n\n  list                List all installed distributions.\n\n  default             Get or set the default distribution, which is used by bash.exe.\n\n  install             Install a new distribution.\n\n  register            Register an existing installation directory.\n\n  uninstall           Uninstall a distribution\n\n  unregister          Unregister a distribution but not delete the directory containing it.\n\n  move                Move a distribution to a new directory.\n\n  run                 Run a command in a distribution.\n\n  dir                 Get the installation directory of a distribution.\n\n  config-env          Get or set the default environment variables of a distribution. (Currently unusable because of a problem of the command line\n                      parser library.)\n\n  config-uid          Get or set the UID of the default user of a distribution.\n\n  config-kernelcmd    Get or set the default kernel command line of a distribution.\n\n  config-flag         Get or set some flags of a distribution. See https://msdn.microsoft.com/en-us/library/windows/desktop/mt826872(v=vs.85).aspx for\n                      details.\n\n  help                Display more information on a specific command.\n\n  version             Display version information.\n\n\nC:\\Users\\bkete\\Downloads\\LxRunOffline-v2.1.1\\LxRunOffline-v2.1.1&gt;</code></pre><p><em>SuccessKid.jpg</em></p>\n<p>I repeated this process several times until I had enough instances of WSL for my current project load, each time putting the storage folder in a new path named for its usage -- like <code>c:\\microsoftfs</code> or <code>c:\\gopherconfs</code>.</p>\n<p>The last step was to figure out how to launch them.  I use <a href=\"https://github.com/mintty/wsltty\">wsltty</a> sometimes as my terminal emulator, and it comes with convenient batch files to launch WSL as a user, as root, and other scenarios.  I copied one of those batch files and modified it to point to one of my new Ubuntu instances like this:</p>\n<h3 id=\"original\">Original</h3>\n<pre><code>%LOCALAPPDATA%\\wsltty\\bin\\mintty.exe -i &quot;%PROGRAMFILES%/WindowsApps/CanonicalGroupLimited.UbuntuonWindows_1604.2017.922.0_x64__79rhkp1fndgsc/images/icon.ico&quot; --WSL= -h err --configdir=&quot;%APPDATA%\\wsltty&quot;  -~  </code></pre><h3 id=\"modified\">Modified</h3>\n<pre><code>%LOCALAPPDATA%\\wsltty\\bin\\mintty.exe -i &quot;%PROGRAMFILES%/WindowsApps/CanonicalGroupLimited.UbuntuonWindows_1604.2017.922.0_x64__79rhkp1fndgsc/images/icon.ico&quot; --WSL=&quot;Gophercon&quot; -h err --configdir=&quot;%APPDATA%\\wsltty&quot;  -~  </code></pre><p>In the modified batch file, the <code>--WSL=&quot;Gophercon&quot;</code> references a registered WSL distribution called <code>Gophercon</code> which I created with <code>LxRunOffline</code>.  I repeated this process for each of the new instances, and changed the icons for them so I can launch them easily from the start menu.</p>\n<p>Now I have multiple installations of WSL/Ubuntu that are isolated from each other.  Exactly what I wanted.  The development workflow is nearly identical to the Linux/LXD version, I open a terminal and start coding.  </p>\n<p>The end result is that each WSL Ubuntu installation has a separate filesystem, so each project is isolated.  Using <a href=\"https://thelocehiliosan.github.io/yadm/\">yadm</a> I can clone my <a href=\"https://github.com/bketelsen/dotfiles\">dotfiles</a> and run the included <code>bootstrap</code> script which updates the system and installs all the packages I need for development with a single command.  That&#39;s quick and easy.</p>\n<p>Windows looks better and better for Linux development.  And the webcam always works...</p>\n<p>:)</p>\n<p>If you like this post and want to caffeinate me even more:</p>\n<style>.bmc-button img{width: 27px !important;margin-bottom: 3px !important;box-shadow: none !important;border: none !important;vertical-align: middle !important;}.bmc-button{line-height: 36px !important;height:37px !important;text-decoration: none !important;display:inline-block !important;color:#000000 !important;background-color:#FFDD00 !important;border-radius: 3px !important;border: 1px solid transparent !important;padding: 1px 9px !important;font-size: 23px !important;letter-spacing:0.6px !important;;box-shadow: 0px 1px 2px rgba(190, 190, 190, 0.5) !important;-webkit-box-shadow: 0px 1px 2px 2px rgba(190, 190, 190, 0.5) !important;margin: 0 auto !important;font-family:'Cookie', cursive !important;-webkit-box-sizing: border-box !important;box-sizing: border-box !important;-o-transition: 0.3s all linear !important;-webkit-transition: 0.3s all linear !important;-moz-transition: 0.3s all linear !important;-ms-transition: 0.3s all linear !important;transition: 0.3s all linear !important;}.bmc-button:hover, .bmc-button:active, .bmc-button:focus {-webkit-box-shadow: 0px 1px 2px 2px rgba(190, 190, 190, 0.5) !important;text-decoration: none !important;box-shadow: 0px 1px 2px 2px rgba(190, 190, 190, 0.5) !important;opacity: 0.85 !important;color:#000000 !important;}</style><link href=\"https://fonts.googleapis.com/css?family=Cookie\" rel=\"stylesheet\"><a class=\"bmc-button\" target=\"_blank\" href=\"https://www.buymeacoffee.com/bketelsen\"><img src=\"https://www.buymeacoffee.com/assets/img/BMC-btn-logo.svg\" alt=\"Buy me a coffee\"><span style=\"margin-left:5px\">Buy me a coffee</span></a>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "wsl",
        "development"
      ],
      "date": "2017-12-13T21:07:59Z",
      "description": "",
      "images": [
        "/images/2017/12/startmenu.png"
      ],
      "slug": "getting-crazy-with-windows-subsystem-for-linux",
      "tags": [
        "wsl",
        "development"
      ],
      "title": "Getting Crazy with Windows Subsystem for Linux",
      "excerpt": "<p>Lately I&apos;ve been on a <a href=\"https://blog.gopheracademy.com/advent-2017/repeatable-isolated-dev-environments/\">mission</a> to separate my development environments by project, and by category (personal/work/Gophercon/etc).  The writeup on the Gopheracademy blog describes a fun way to create an isolated container-based environment for each project by using LXD on Ubuntu.</p>",
      "meta": {
        "relativePath": "posts/getting-crazy-with-windows-subsystem-for-linux.html",
        "createdAt": "2020-11-05T00:07:43.510Z",
        "lastModified": "2020-11-05T00:07:43.510Z",
        "size": 7425,
        "formattedSize": "7.3 KB"
      }
    },
    {
      "id": "posts__go17",
      "contents": "<p>Release day is always fun, and Go releases get me pretty excited.  The 1.7 release is especially nice, so I&#39;m going to mention some of my favorite changes in this release.</p>\n<!-- more -->\n<h3 id=\"ibm-z-system-support\">IBM z System Support</h3>\n<p>Bill O&#39;Farrell gave a <a href=\"https://github.com/gophercon/2016-talks/blob/master/BillO&#39;Farrell-GoForLinuxOnZ.pptx\">talk</a> at GopherCon 2016 about this port and I found it fascinating.  Supporting Go on big iron can only be good for the language and for Go users everywhere.  This is an exciting development and I&#39;m looking forward to see what comes next from the IBM team.</p>\n<h3 id=\"ssa-in-the-compiler\">SSA In the Compiler</h3>\n<p>The compiler got an upgrade in Go 1.7 -- with Static Single Assignment, or SSA support.  This new SSA support means that it will be easier in the future to analyze and optimize your code while it&#39;s being compiled.  Coupled with other changes in the compiler toolchain, we&#39;ve already seen some nice improvements both in compile times and binary size decreases.  Kudos to the Go team for putting in the hard work and planning for future optimizations.  SSA is going to bring us big things.</p>\n<h3 id=\"context-is-now-in-standard-library\">Context is now in standard library</h3>\n<p>Perhaps my favorite new feature: the x/net/context package has been moved into the standard library.  Additionally, packages like net/http and os/exec have gained support for this new package without breaking the Go 1 compatibility contract.  The Context package allows you to support cancelation, timeouts, and stores interesting request-specific data -- allowing you to have more control over the network requests that you make.</p>\n<h3 id=\"macos-sierra\">macOS Sierra</h3>\n<p>A big caveat with this release:  If you compile binaries for macOS Sierra you&#39;ll need to use either Go 1.6.3 or Go 1.7.  Binaries compiled with older versions of Go won&#39;t work reliably on macOS Sierra.  They may appear to be working, but I&#39;ve seen firsthand that they&#39;ll eventually fail in spectacular ways.  If you distribute binaries using an automated build system, please update your automation to use Go 1.6.3 or Go 1.7.</p>\n<p>** UPDATE ** Go 1.6.3 was re-broken with the new macOS Sierra beta 4.  Use 1.7.</p>\n<h3 id=\"performance\">Performance</h3>\n<p>Changes to the garbage collector and other runtime components should result in a &quot;5-35%&quot; improvement in the speed of your application.  I absolutely love that Go gets better and faster with each release.  Compile times are coming back down after the big spike in the 1.5 release.</p>\n<h3 id=\"hooray\">Hooray!</h3>\n<p>Check out all of the changes over on the Go <a href=\"https://golang.org/doc/go1.7\">blog</a>.  And fire up your <a href=\"https://golang.org/dl/\">downloads</a>.</p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "go",
        "release"
      ],
      "date": "2016-08-15T22:55:00Z",
      "description": "",
      "images": [
        "https://images.unsplash.com/photo-1487505983481-9aa2d9f9901a?ixlib=rb-0.3.5&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=1080&fit=max&s=beb2fdb8e2d1f0b888d896ae904bbb9d"
      ],
      "slug": "go17",
      "tags": [
        "go",
        "release"
      ],
      "title": "Go 1.7 Released",
      "excerpt": "<p>Release day is always fun, and Go releases get me pretty excited.  The 1.7 release is especially nice, so I&apos;m going to mention some of my favorite changes in this release.</p>",
      "meta": {
        "relativePath": "posts/go17.html",
        "createdAt": "2020-11-05T00:07:55.830Z",
        "lastModified": "2020-11-05T00:07:55.830Z",
        "size": 2896,
        "formattedSize": "2.8 KB"
      }
    },
    {
      "id": "posts__going-overboard-with-wsl-metadata",
      "contents": "<h3 id=\"nerd-sniped\">Nerd Sniped</h3>\n<p>It all started with a simple tweet from <a href=\"https://twitter.com/nunixtech\">@nunixtech</a>:</p>\n<!-- more -->\n\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/VirtualScooley?ref_src=twsrc%5Etfw\">@VirtualScooley</a> <a href=\"https://twitter.com/richturn_ms?ref_src=twsrc%5Etfw\">@richturn_ms</a> <a href=\"https://twitter.com/tara_msft?ref_src=twsrc%5Etfw\">@tara_msft</a> <a href=\"https://twitter.com/CraigWilhite?ref_src=twsrc%5Etfw\">@CraigWilhite</a> <a href=\"https://twitter.com/benhillis?ref_src=twsrc%5Etfw\">@benhillis</a> In order to Thank You for the new Distros, here is a small hack from your &quot;favorite&quot; WSLCorsair. the mount options might need some review though. <a href=\"https://twitter.com/bketelsen?ref_src=twsrc%5Etfw\">@bketelsen</a> this might help you (do I enter the HAT gift list? ?) <a href=\"https://t.co/7ouUX5Jm3h\">pic.twitter.com/7ouUX5Jm3h</a></p>&mdash; Nuno do Carmo (@nunixtech) <a href=\"https://twitter.com/nunixtech/status/971145708018466816?ref_src=twsrc%5Etfw\">March 6, 2018</a></blockquote>\n\n<p>Nuno showed how to use new <a href=\"https://cda.ms/hs\">metadata support</a> in Windows Subsystem For Linux to enable Linux permissions and metadata on a mounted Windows share.  Never content to let a good hack go unexplored, I wanted to see if it was possible to make a Windows folder be my WSL home directory with no adverse side-effects.</p>\n<h3 id=\"the-setup\">The Setup</h3>\n<p>I started with an existing and well-used WSL installation of Ubuntu.  My first step was to replicate Nuno&#39;s example, mounting a Windows shared drive with appropriate Linux metadata.  It worked well. But I wanted to make that directory my <code>$HOME</code>, and have access from both Windows and WSL with no penalties or worries about permissions or corrupted files.</p>\n<p>I created a folder on my <code>C:\\</code> drive called <code>home</code>.  I then shared the directory as Nuno did so it could be mounted from <code>/etc/fstab</code> on the WSL side of things.</p>\n<h3 id=\"first-attempt\">First Attempt</h3>\n<p>The first thing I tried doing was changing my <code>/etc/fstab</code> entry for the mounted share to mount it at <code>/home/bketelsen</code>.  It worked, but of course it replaced my existing home directory with the mounted one.  I reversed my change in <code>fstab</code> and made a new mountpoint at <code>/home/bketelsen2</code>.  I mounted the Windows share there, then used <code>rsync</code> to copy my old WSL-only home into the mounted directory:</p>\n<pre><code>$&gt; rsync -azvh /home/bketelsen/ /home/bketelsen2</code></pre><p>This took quite a while to complete because my home directory in WSL was full of code.  When it finished, I had a full copy of my WSL home <code>/home/bketelsen2</code> directory which was mounted from <code>C:\\home</code>.  On the Windows side, the <code>C:\\home</code> directory shows all of my WSL files:</p>\n<p><img src=\"/images/2018/03/windows-side-1.PNG\" alt=\"Windows Side\"></p>\n<p>That&#39;s pretty slick!  Now all I needed to do was make that my $HOME and I&#39;d be set. </p>\n<blockquote>\n<p>Narrator: Nothing is ever that easy.</p>\n</blockquote>\n<p><a href=\"http://wslcorsair.blogspot.ch/2018/03/wsl-one-home-to-host-them-all.html\">Nuno&#39;s post</a> shows mounting the Windows share using <code>/etc/fstab</code> which works, but I couldn&#39;t get the extra <code>metadata</code> flag in the mount line to actually make metadata support work. I don&#39;t know if this is by design, or an omission, but I didn&#39;t notice it until I tried making an ssh connection and my ssh keys had overly broad permissions.  After changing the keys&#39; permissions, it still failed.  The <code>chmod</code> command didn&#39;t apply the expected permissions.</p>\n<h3 id=\"second-attempt\">Second Attempt</h3>\n<p>I pondered a bit and realized that I was dealing with Linux, and mounting the share at <code>/home/bketelsen</code> was only one way to solve the problem.  The other way is to change my home directory&#39;s location in the Linux user database.  Specifically, using the <code>usermod</code> command:</p>\n<pre><code>sudo usermod -d /mnt/c/home bketelsen</code></pre><p>This is the right command, but it fails because the WSL process is spawned as a <code>bash</code> process started by my user, <code>bketelsen</code>.  There can be no processes running as <code>bketelsen</code> when you make the <code>usermod</code> change, so that approach wouldn&#39;t work.  I searched for ways to launch WSL directly as the root user, but in the middle of that search I remembered that the home directory is actually specified in <code>/etc/passwd</code>:</p>\n<pre><code>bketelsen:x:1000:1000:,,,:/home/bketelsen:/bin/bash</code></pre><p>YES!  I edited this file to reflect my new desired $HOME directory:</p>\n<pre><code>bketelsen:x:1000:1000:,,,:/mnt/c/home:/bin/bash</code></pre><p>Closing and re-opening WSL confirmed that my WSL <code>$HOME</code> directory was now <code>/mnt/c/home</code> which contained all the files that were previously stored in <code>/home/bketelsen</code>.  I quickly created a text file from the Windows side at <code>C:\\home\\thing.txt</code> and verified that it existed on the WSL mount too.</p>\n<h3 id=\"success\">SUCCESS</h3>\n<p>With this setup, I have a single folder -- <code>C:\\home</code> -- available in Windows, but also mounted as my WSL <code>$HOME</code>, too.  Files can be modified on either side, with no apparent ill effects. <strong><em>Editors Note: This is unproven, and not for risk-averse people.  Use this setup at your own risk.  Backup your data.</em></strong> </p>\n<p><img src=\"/images/2018/03/wsl-side.PNG\" alt=\"wsl-side\"></p>\n<h3 id=\"one-more-thing\">One More Thing</h3>\n<p>Because too much is never enough, I wanted to prove that this would work for more than one WSL installation.  So I installed the just-announced Debian WSL app, and applied exactly the same change to my <code>/etc/passwd</code> file and <code>/etc/wsl.conf</code> files.</p>\n<p><img src=\"/images/2018/03/debian-installer.PNG\" alt=\"debian-installer\"></p>\n<p>Now I have two different Linux installations in WSL: Ubuntu and Debian.  They have separate root filesystems, but a single shared <code>$HOME</code> directory:</p>\n<p><img src=\"/images/2018/03/debian.PNG\" alt=\"debian\"></p>\n<p>This is extremely cool.  I set up my Go development environment on the Windows side using <a href=\"https://cda.ms/ht\">Visual Studio Code</a> but set the <code>$GOPATH</code> to <code>C:\\home\\go</code>, which is the same as <code>$HOME/go</code> on the WSL side.  Now I can develop in Windows or WSL/Linux against the exact same code without any strange permission problems.  Most of the time I&#39;ll probably stay in <code>neovim</code>, because it&#39;s my first love.  But there are no issues when I use VS Code from the Windows side.  I can compile and test from both Windows and Linux with the same source directory.  </p>\n<p>Here&#39;s the contents of my <code>/etc/wsl.conf</code> for your perusal:</p>\n<pre><code># Enable extra metadata options by default\n[automount]\nenabled = true\noptions = &quot;metadata,umask=22,fmask=11&quot;\nmountFsTab = true\n\n# Enable DNS – even though these are turned on by default, we’ll specify here just to be explicit.\n[network]\ngenerateHosts = true\ngenerateResolvConf = true</code></pre><p>Thank you to <a href=\"https://twitter.com/nunixtech\">@nunixtech</a> for the idea that spawned this probably-evil hack. I&#39;m unreasonably delighted with how cool this little hack is, and it opens a lot of other possibilities for other potentially unauthorized or dangerous hacks, too.  If you&#39;ve done something equally unorthodox with your WSL install, tell me about it on <a href=\"https://twitter.com/bketelsen\">twitter</a>!</p>\n<h3 id=\"update\">Update</h3>\n<p>I realized after this worked that the next logical progression of this experiment was to share the same $HOME between Windows and WSL.  TLDR; It works perfectly.  I updated my <code>/etc/passwd</code> home directory entry to <code>/mnt/c/Users/bkete</code>, moved the contents of the <code>c:\\home</code> directory into <code>c:\\Users\\bkete</code>, and now I have a single shared home directory between Windows and WSL.  Here&#39;s a picture of my OneDrive directory being accessed from WSL as <code>$HOME/OneDrive</code>:</p>\n<p><img src=\"/images/2018/03/onedrive.PNG\" alt=\"onedrive\"></p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "hacks",
        "windows",
        "linux"
      ],
      "date": "2018-03-10T00:42:39Z",
      "description": "Use a folder from your Windows drive as your $HOME directory in WSL",
      "images": [
        "/images/2018/03/windows-side.PNG"
      ],
      "slug": "going-overboard-with-wsl-metadata",
      "tags": [
        "hacks",
        "windows",
        "linux"
      ],
      "title": "Going Overboard with WSL metadata",
      "excerpt": "<p>It all started with a simple tweet from <a href=\"https://twitter.com/nunixtech\">@nunixtech</a>:</p>",
      "meta": {
        "relativePath": "posts/going-overboard-with-wsl-metadata.html",
        "createdAt": "2020-11-05T00:08:10.690Z",
        "lastModified": "2020-11-05T00:08:10.690Z",
        "size": 7755,
        "formattedSize": "7.6 KB"
      }
    },
    {
      "id": "posts__caddy-hugo-encrypt",
      "contents": "<p>I spent all of 5 minutes configuring <a href=\"https://caddyserver.com\">Caddy</a> to automatically pull content from github, post-process it with <a href=\"http://gohugo.io\">hugo</a> and serve it up with fresh SSL/TLS certificates from Let&#39;s Encrypt. <!-- more --></p>\n<p>When you think about it, that&#39;s pretty damned amazing.  Caddy already made web serving easy.  It powers everything I do now: gopheracademy.com, gophercon.com and a dozen more.  Add hugo to the mix and you have a really powerful publishing platform that is fully automated with just a git push.  I really love that Caddy polls my github repository and publishes new content.  It&#39;s a zero-overhead proposition to publish a new post.</p>\n<p>After configuring the Let&#39;s Encrypt integration, my esteem for Caddy leveled up to 11.  I did almost nothing to enable it.  Changed a flag in the command line to invoke Caddy, changed the URL in the Caddy configuration file from http to https.  In the background, Caddy requested and installed the certificates for me, and will continue to renew them before they expire.  SSL Everywhere is no longer a dream, it&#39;s real, it&#39;s here, and the tools couldn&#39;t be easier to use.</p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "hugo",
        "caddy",
        "let's encrypt"
      ],
      "date": "2015-11-11T23:49:00Z",
      "description": "",
      "images": [
        "https://images.unsplash.com/photo-1477244075012-5cc28286e465?ixlib=rb-0.3.5&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=1080&fit=max&s=650281f5f6da101b6954a53645bf6501"
      ],
      "slug": "caddy-hugo-encrypt",
      "tags": [
        "hugo",
        "caddy",
        "let's encrypt"
      ],
      "title": "Caddy and Let's Encrypt",
      "excerpt": "<p>I spent all of 5 minutes configuring <a href=\"https://caddyserver.com\">Caddy</a> to automatically pull content from github, post-process it with <a href=\"http://gohugo.io\">hugo</a> and serve it up with fresh SSL/TLS certificates from Let&apos;s Encrypt. <!-- more --></p>",
      "meta": {
        "relativePath": "posts/caddy-hugo-encrypt.html",
        "createdAt": "2020-11-05T00:12:30.970Z",
        "lastModified": "2020-11-05T00:12:30.970Z",
        "size": 1570,
        "formattedSize": "1.5 KB"
      }
    },
    {
      "id": "posts__gophercon-on-azure",
      "contents": "<p>I&#39;ve recently taken on a new role at Microsoft as a Cloud Developer Advocate for Open Source projects on Azure.  My purview is Go, Linux, Containers, and Kubernetes.  While brainstorming ways to learn about all that Azure has to offer an idea occured to me:  Why not move Gophercon over to Azure as a learning tool.  I&#39;ve decided to do just that and share my learnings along the way.</p>\n<!-- more -->\n\n<p>This year we used <a href=\"https://gobuffalo.io\">Buffalo</a> and <a href=\"https://ponzu-cms.org\">Ponzu</a> as the main components of the website for Gophercon.  Generally it was a huge improvement over our previous <a href=\"https://gohugo.io\">hugo</a> workflow, because Ponzu allowed us to get non-technical people contributing content.  Hugo is amazing, but requiring <code>git</code> limits the people who can edit the site.</p>\n<p>For 2018 I want to step up my game and build the site using <a href=\"https://github.com/gopherjs/gopherjs\">GopherJS</a>.  <a href=\"https://twitter.com/_myitcv\">Paul Jolly</a> has built some really clean React bindings for GopherJS, and I think this is a good opportunity for me to polish up my frontend chops which are sorely lacking.</p>\n<p>Since we don&#39;t really need the site to be functional until roughly the end of December (beyond a placeholder page) that gives me an opportunity to get all of this worked out and setup.  Here are my goals:</p>\n<ul>\n<li>100% Continuous Integration and Continuous Delivery</li>\n<li>Enable content editors/creators to publish without a <code>git</code> workflow</li>\n<li>Explore as much of the Azure ecosystem as I can during the process</li>\n<li>Favor Go projects where I can, but choose the right tools for the job</li>\n<li>Use CDN for static assets</li>\n</ul>\n<p>Last year, <a href=\"https://twitter.com/ashleymcnamara\">Ashley McNamara</a> was my partner in crime for the GopherCon website.  She&#39;s graciously agreed to continue in this role for 2018, so we&#39;ll be learning together for some of this.</p>\n<p>I&#39;m excited to learn new things, and share as I go.  Thanks for coming along for the ride.</p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "go",
        "azure"
      ],
      "date": "2017-07-31T22:56:00Z",
      "description": "",
      "images": [
        "/images/2017/09/azure.png"
      ],
      "slug": "gophercon-on-azure",
      "tags": [
        "go",
        "azure"
      ],
      "title": "Learn With Me: Moving Gophercon to Azure",
      "excerpt": "<p>I&apos;ve recently taken on a new role at Microsoft as a Cloud Developer Advocate for Open Source projects on Azure.  My purview is Go, Linux, Containers, and Kubernetes.  While brainstorming ways to learn about all that Azure has to offer an idea occured to me:  Why not move Gophercon over to Azure as a learning tool.  I&apos;ve decided to do just that and share my learnings along the way.</p>",
      "meta": {
        "relativePath": "posts/gophercon-on-azure.html",
        "createdAt": "2020-11-05T00:08:20.070Z",
        "lastModified": "2020-11-05T00:08:20.070Z",
        "size": 2173,
        "formattedSize": "2.1 KB"
      }
    },
    {
      "id": "posts__hello-wascc",
      "contents": "<p>I&#39;m <em>really excited</em> about Web Assembly on the server. The promise of sandboxed and portable code feels like the realization of the vision Docker tried to achieve. In this article I&#39;m going to walk through creating a service using <a href=\"https://wascc.dev/\">waSCC</a>, which is a host runtime for running actors written in web assembly. We&#39;ll mostly follow the tutorial for creating a new actor, but with more nuance, and specifics for using WSL2 on my Windows Laptop added for completeness.</p>\n<!-- more -->\n\n<h2 id=\"wasm-on-the-server\">WASM on the Server</h2>\n<p>** This article includes information on how to setup my development environment in WSL2, because it&#39;s part of my <a href=\"/windows-for-open-source-development\">#30DayWSLChallenge</a>.</p>\n<h3 id=\"development-environment\">Development Environment</h3>\n<p><code>waSCC</code> is a Rust project, and as such requires Rust to be installed. My <a href=\"https://github.com/bketelsen/dotfiles/blob/master/bin/setup/executable_rust.sh\">dotfiles</a> include a script in <code>~/bin/</code> to install Rust using &quot;rustup&quot;. Invoking that script installs the latest version of stable Rust tooling. As of the time of this post, that&#39;s <code>1.41.0</code>.</p>\n<p><code>waSCC</code> has a nice project template that you can use to kickstart your development. It requires the <code>cargo-generate</code> crate to be installed, so let&#39;s get that going:</p>\n<pre><code>&gt; cargo install cargo-generate</code></pre><p>We also need the web assembly cross-compilation target so that we can build <code>.wasm</code> modules from Rust. Install it using the same <code>rustup</code> tool we used to install Rust itself:</p>\n<pre><code>&gt; rustup target add wasm32-unknown-unknown</code></pre><h2 id=\"references-and-further-information\">References and Further Information</h2>\n<ul>\n<li><a href=\"https://wascc.dev\">waSCC</a></li>\n<li><a href=\"https://wascc.dev/tutorials/first-actor/\">First Actor Tutorial</a></li>\n<li><a href=\"https://twitter.com/kevinhoffman\">Kevin Hoffman on Twitter</a></li>\n</ul>\n",
      "title": "Hello waSCC",
      "layout": "post",
      "date": "2020-02-25",
      "slug": "hello-wascc",
      "images": [
        "/images/h3GAGi5tXMU.jpg"
      ],
      "thumbnail": "/images/h3GAGi5tXMU-thumb.jpg",
      "credit": "https://unsplash.com/photos/h3GAGi5tXMU",
      "description": "Web Assembly on the Server",
      "tags": [
        "windows",
        "linux",
        "open source",
        "30daywslchallenge",
        "wasm"
      ],
      "classes": [
        "feature-hyphenate",
        "feature-justify",
        "feature-highlight"
      ],
      "categories": [
        "Linux",
        "Windows",
        "Open Source",
        "Web Assembly"
      ],
      "excerpt": "<p>I&apos;m <em>really excited</em> about Web Assembly on the server. The promise of sandboxed and portable code feels like the realization of the vision Docker tried to achieve. In this article I&apos;m going to walk through creating a service using <a href=\"https://wascc.dev/\">waSCC</a>, which is a host runtime for running actors written in web assembly. We&apos;ll mostly follow the tutorial for creating a new actor, but with more nuance, and specifics for using WSL2 on my Windows Laptop added for completeness.</p>",
      "meta": {
        "relativePath": "posts/hello-wascc.html",
        "createdAt": "2020-11-05T00:09:17.530Z",
        "lastModified": "2020-11-05T00:09:17.530Z",
        "size": 2161,
        "formattedSize": "2.1 KB"
      }
    },
    {
      "id": "posts__i3-windows",
      "contents": "<p>That might be the longest title for a blog post ever, but it&#39;s kind of hard to describe what&#39;s going on here if you&#39;re not familiar with the latest updates from Microsoft land.  <!--more-->Here&#39;s a quick refresher:</p>\n<ul>\n<li><p>This spring Microsoft announced <a href=\"https://msdn.microsoft.com/en-us/commandline/wsl/about\">Bash on Ubuntu on Windows</a>, also known as the Windows Subsystem for Linux.  Read the post, the FAQ, etc in that link.  I&#39;ll summarize: Microsoft wants to make Windows the best place for ALL developers to work.  A lofty and ambitious goal, to say the least.  Their crazy idea -- translate Linux system calls into NT Kernel calls using a small shim layer.</p>\n</li>\n<li><p>This is not a virtual machine.  The system calls are translated by the shim layer (WSL) and run directly on the NT Kernel.</p>\n</li>\n<li><p>This is kind of a Big Deal.  If it works, it has the potential to win back many developers who abandoned the Windows platform years ago because of the inability of Windows to deal with the *nix world.  The huge popularity of Ruby, Python, Redis, and dozens of other *nix first tools that were born in *nix.  Some of these tools, like Ruby, have Windows installers, but Windows is an afterthought and second-class citizen at best.</p>\n</li>\n<li><p>Many developers (like me) started using Windows but moved to Mac or Linux operating systems over the years as it became increasingly hard to write software in Windows.  </p>\n</li>\n<li><p>[Opinion] Linux isn&#39;t the best place to work 100% of the time.  Office applications are lacking compatibility and features.  There is no decent email client for Linux.  Save your apologist comments and <em>what about Open Office/Geary/Thunderbird</em> comments.  If you&#39;ve used them, you know that they&#39;re not as nice as the applications available in macOS and Windows.</p>\n</li>\n<li><p>[Opinion] macOS is slipping in quality, and falling behind in features.  I&#39;ve grown increasingly frustrated over the past 3 years using MacOS X as my daily driver.  Frequent crashes and very poor QA from Apple have lead to an operating system that used to be amazing becoming less so at each release.  I used to be a dyed in the wool Mac zealot.  Apple eroded my confidence in their operating system to the point that macOS is now where I go to do emails and other administrative tasks, but I do daily development on an Arch linux desktop sitting next to my MacBook Pro.  Worse, although macOS is UNIX compliant and has an almost-*nix like environment available, far too many things don&#39;t work in macOS that are required for modern Internet software development.  The hacks that we&#39;ve put up with over the years are a testament to how poor Linux is for administrative work and how nice macOS was for the same.</p>\n</li>\n</ul>\n<p>Given this set of circumstances and opinions, I was more than a little excited when Microsoft announced WSL.  It promised to give developers what could be the best of all worlds.  A modern and capable desktop operating system -- Windows 10 -- with all of the quality features and support for modern hardware that we would expect.  AND a real installation of Ubuntu Linux running along side of it.  Not virtualized, running in Virtual Box or Parallels Desktop or VMWare, but right there on my laptop running at native speed.  The idea has real promise.</p>\n<p>So when I got a new Dell XPS 13 Developer Edition (Ubuntu Pre-installed) the first thing I did was put the latest version of Windows 10 Insider Edition on it.  Over the course of a day it updated to Build 14379, which is the latest as of July 2, 2016.  I had tried previous builds, but found simple things like git or zsh didn&#39;t work well.</p>\n<p>Imagine my surprise when I installed Bash for Windows on this build and pretty much everything worked.  I cloned my <a href=\"https://github.com/bketelsen/dotfiles\">dotfiles</a> and ran the post-install scripts that install i3 window manager, neovim, zsh, Go, and all the requisite development tools that I&#39;m used to.  Nothing failed. (I didn&#39;t try running i3 yet, because I knew there was no X server installed)</p>\n<p><em>Nothing Failed</em></p>\n<p>The real shortfall of running Bash for Windows right now is the lack of a good terminal emulator.  I tried ConEmu and maybe half a dozen others, with ConEmu being the best of this sorry lot.  If you&#39;re used to using a good terminal in Linux, none of the tools available on Windows are going to satisfy you.</p>\n<p>I knew from my Windows work 20 years ago that there were XWindows servers available.  I searched and found MobaXterm.  It has a built in terminal emulator (also crap -- sorry), but among the other features included there&#39;s a pretty good X Windows server. </p>\n<p>I&#39;ve been in love with i3 window manager since Erik St. Martin introduced me to it 3 years ago.  Having such nicely organized and tiled windows over multiple desktops is an amazing productivity boon.  With good keyboard shortcuts for every operation, I found I never took my hands off the keyboard.  </p>\n<p>I started MobaXTerm and looked at the X Server settings.  I shrugged, fired up the X Server and typed &quot;i3&quot; in my bash prompt.  <code>i3</code> complained that there was another window manager already running.  I went back to the X Server settings and chose &quot;Windowed Mode: X11 Server constrained to a single window&quot;.  It was the only X Server that didn&#39;t also start a window manager like <code>dwm</code> or <code>fvwm</code>.  So it started a simple &quot;rooted&quot; X Server which appears as a window on my Windows desktop with a black screen.</p>\n<p>Returning to bash, I typed <code>i3</code> again.  Gloriously, the famililar <code>i3</code> session appeared.  I&#39;m able to install and run Linux GUI applications like Firefox.  I have <code>terminator</code> running as my terminal emulator.  I&#39;m running <code>zsh</code> as my shell.  Neovim <em>just works</em>, as does Go.  All of them think they&#39;re running on a Linux computer, because for all intents and purposes they are.  It just happens to have a Windows NT kernel at its core.</p>\n<p>Strange, strange times we live in. 20 years ago Microsoft called Linux a cancer and did everything they could to make it die.  Today they&#39;re embracing Linux -- and by extension me -- and I have to say I&#39;m really impressed with the outcome.</p>\n<p><em>This article was created in <code>neovim</code> for Linux, running on a <code>zsh</code> shell inside <code>i3 window manager</code> running in a MobaXTerm X Server on a Windows 10 laptop.</em></p>\n<p>Screen shots:</p>\n<p><a href=\"/images/2017/09/i3.png\">i3 in MobaXTerm</a>\n<a href=\"/images/2017/09/windows-on-top.png\">i3 behind Windows</a></p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "windows",
        "linux",
        "i3"
      ],
      "date": "2016-07-03T22:46:00Z",
      "description": "",
      "images": [
        "/images/2017/09/windows-on-top-1.png"
      ],
      "slug": "i3-windows",
      "tags": [
        "windows",
        "linux",
        "i3"
      ],
      "title": "Running i3 Window Manager on Bash For Windows",
      "excerpt": "<p>That might be the longest title for a blog post ever, but it&apos;s kind of hard to describe what&apos;s going on here if you&apos;re not familiar with the latest updates from Microsoft land.  <!--more-->Here&apos;s a quick refresher:</p>",
      "meta": {
        "relativePath": "posts/i3-windows.html",
        "createdAt": "2020-11-05T00:09:21.000Z",
        "lastModified": "2020-11-05T00:09:21.000Z",
        "size": 6610,
        "formattedSize": "6.5 KB"
      }
    },
    {
      "id": "posts__install-func",
      "contents": "<p>This bash setup is the latest evolution of my quest to make a new system install as fast as possible.</p>\n<!-- more -->\n\n<h2 id=\"speed-up-software-installs-with-this-bash-trick\">Speed Up Software Installs with this Bash Trick</h2>\n<p>I&#39;ve created a <code>bash</code> function that enables quick software installs without being as heavy as something like <code>ansible</code>. The system relies on a single function in my <code>bashrc</code> and a directory full of bash scripts. Let&#39;s dive in and see how it works.</p>\n<h3 id=\"installation-scripts\">Installation Scripts</h3>\n<p>In my dotfiles directory, which is stored at <code>~/dotfiles</code> there&#39;s a subdirectory called <code>install</code>. That directory contains a few dozen bash scripts that install the various software components and packages I might use. Some of them are needed on all the computers I use, some of them are used only infrequently for certain projects. Here&#39;s an example that installs Go:</p>\n<pre><code class=\"language-bash\">❯ go.sh \n#! /bin/bash\nset -e\nVERSION=1.15\n# Delete existing Go installation\nsudo rm -rf /usr/local/go\n# Install Go in /usr/local\nsudo mkdir -p /usr/local/go &amp;&amp; curl -Ls https://storage.googleapis.com/golang/go$VERSION.linux-amd64.tar.gz | sudo tar xvzf - -C /usr/local/go --strip-components=1</code></pre>\n<p>The script declares a <code>VERSION</code> variable so I can change the version to be installed when there&#39;s a new release of Go. Then it deletes the existing Go installation and replaces it with a freshly downloaded version. Because it deletes the existing install and replaces it, it can be run more than once with no unwanted side-effects. I&#39;ve attempted to make all my scripts idempotent like this, but some of them just aren&#39;t because my bash skills are just mediocre.</p>\n<h3 id=\"installation-function\">Installation Function</h3>\n<p>To use these installation scripts I&#39;ve created a bash function that searches for scripts in the <code>~/dotfiles/install</code> folder matching the first argument of the function:</p>\n<pre><code class=\"language-bash\">inst() {\n    if [ -f $HOME/dotfiles/install/$1.sh ] ; then\n        echo Installing $1\n        . $HOME/dotfiles/install/$1.sh    \n    else\n        echo $1 not found\n    fi\n}</code></pre>\n<p>To install Go using this function I would type <code>$&gt; inst go</code>, which would search for a script called <code>~/dotfiles/install/go.sh</code> and execute it if it exists. It&#39;s not complicated, and only took a few minutes to write the function, but I&#39;m getting a lot of ROI on the time I spend writing installation scripts. When I spin up a new VM somewhere, I can quickly clone my dotfiles and install just the bits I need for a particular task.</p>\n<h3 id=\"direnv-integration\">Direnv integration</h3>\n<p>I&#39;ve been playing with <code>direnv</code> integrations to make the installation of required tools or commands automatic when entering a project directory. I haven&#39;t found anything yet that doesn&#39;t feel too &quot;hacky&quot;, so I haven&#39;t finished this part.</p>\n<h2 id=\"future-ideas\">Future Ideas</h2>\n<p>In the future I may extend the script to search for installation scripts with an <code>arch</code> component in the file path, like <code>~/dotfiles/install/linux/go.sh</code> or <code>~/dotfiles/install/macos/go.sh</code>.  I don&#39;t have a need for this right now because I&#39;m not using my Mac for development work.</p>\n<p>I may also consider making <code>meta</code> scripts that call others. It might be similar to installing a Development metapackage, where the metapackage simply calls the other packages it wants to wrap. </p>\n",
      "title": "Bash Helpers for Quick Installs",
      "layout": "post",
      "date": "2020-08-14",
      "slug": "install-funs",
      "images": [
        "/images/4pPzKfd6BEg.jpg"
      ],
      "thumbnail": "/images/4pPzKfd6BEg-thumb.jpg",
      "credit": "https://unsplash.com/photos/4pPzKfd6BEg",
      "description": "A quick helper function and directory layout for repeatable software installs.",
      "tags": [
        "linux",
        "open source"
      ],
      "classes": [
        "feature-hyphenate",
        "feature-justify",
        "feature-highlight"
      ],
      "categories": [
        "Linux"
      ],
      "excerpt": "<p>This bash setup is the latest evolution of my quest to make a new system install as fast as possible.</p>",
      "meta": {
        "relativePath": "posts/install-func.html",
        "createdAt": "2020-11-05T00:09:10.240Z",
        "lastModified": "2020-11-05T00:09:10.240Z",
        "size": 3576,
        "formattedSize": "3.5 KB"
      }
    },
    {
      "id": "posts__my-cross-platform-dev-setup-on-surface-laptop",
      "contents": "<p>I want to document a setup that I&#39;ve found that works really well for me using Windows 10 and <a href=\"https://blogs.msdn.microsoft.com/wsl/2016/04/22/windows-subsystem-for-linux-overview/\">Windows Subsystem for Linux</a> for general development.  Before we dive into any specifics, though, I want to provide some background and explain my objectives which will help to frame the decisions I&#39;ve made and the trade-offs chosen to reach a more ideal environment.</p>\n<!-- more -->\n\n<h3 id=\"objective\">Objective</h3>\n<p>My objective is to build a development environment that is comfortable for Open Source development with a target of mostly Linux servers.  I develop primarily in <a href=\"https://golang.org\">Go</a> but infrequently do some Javascript and HTML work too.  Prior to this setup, I have been using a Linux dev machine either directly or remotely over SSH.  My ultimate goal is to replicate a Linux development environment without having to use a separate machine.   </p>\n<h3 id=\"trade-offs\">Trade Offs</h3>\n<p>There are some implicit trade-offs in this setup, and I will acknowledge them along the way.  I recognize that this setup isn&#39;t perfect, but I&#39;ve found it to be very comfortable with very few limitations.</p>\n<h3 id=\"preferences\">Preferences</h3>\n<p>It&#39;s also useful to acknowledge my personal preferences, since they obviously inform these decisions.  I prefer to develop completely in Linux.  I prefer not to have to fight to use Linux as a primary desktop operating system.  I prefer to have only one computer.  I prefer [neo]vim for most editing, but reserve the right to use a GUI when I want to.  Another preference that is important here: I really dislike local VM&#39;s for development.  They get lost, they aren&#39;t sharable, file sharing between host and VM is flaky.  I just can&#39;t use a local VM for development work.</p>\n<h3 id=\"the-tldr\">The TL;DR</h3>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/_y2e4QaUktQ\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>\n\n<h3 id=\"the-setup\">The Setup</h3>\n<ul>\n<li><strong>Surface Laptop:</strong> i7, 16GB RAM, 512GB SSD, Surface Dock</li>\n<li><strong>Operating System:</strong> Windows 10 - Insider Edition</li>\n<li><strong>Shell:</strong> Windows Subsystem for Linux (also called Windows Bash)</li>\n<li><strong>Code Editors:</strong> neovim and Visual Studio Code</li>\n</ul>\n<h3 id=\"configuration\">Configuration</h3>\n<p>There are a few key components to this configuration that make it unique, and improved my happiness dramatically.</p>\n<h4 id=\"where-to-put-the-code\">Where to put the code</h4>\n<p>I store my code in Windows.  For the past year I treated the WSL filesystem and the Windows filesystem as two separate entities with a hard border between them.  WSL allows you to access the Windows filesystem through a mount at &#39;/mnt/c&#39; which is awesome, but viewing those files in WSL just bothered me because the permissions show as &#39;777&#39; with an owner of &#39;root&#39;.  This bothers me most because of the ugly display of these permissions in bash.  Like many people, I had an alias in my bash settings to append &quot;--color=auto&quot; to my &#39;ls&#39; calls.  This causes files with excessive permissions to show up in black text with a bright green background.  </p>\n<blockquote>\n<p>It drove me crazy, and blocked me from even looking at the windows filesystem from bash.  </p>\n</blockquote>\n<p><img src=\"/images/2017/09/uglycolors.png\" alt=\"uglycolors\"></p>\n<p>That meant that my source code was only in WSL&#39;s filesystem, and completely invisible to Windows.   In turn, this caused limitations on what I could do with the code.  Because it was only in WSL, I had to operate on the files using either command-line tools, or X Windows tools using an X Client from Windows.  It wasn&#39;t a show-stopper, but it was a little awkward.</p>\n<p>I don&#39;t know why it didn&#39;t occur to me before, but I just removed the &quot;--color=auto&quot; settings in my .bashrc last weekend, and suddenly I was perfectly happy looking at files on the Windows filesystem from WSL&#39;s bash. <img src=\"/content/images/2017/09/nouglycolors.png\" alt=\"nouglycolors\">  No strange colors, no mental block about viewing the files!  This was actually a pretty big turning point for me.  As crazy as it may sound, just removing coloring from my bash prompt unblocked me from using and viewing the Windows filesystem from WSL.  Tiny change, huge mental gain.  I moved my code from WSL to the Windows filesystem:</p>\n<pre><code>mv ~/src /mnt/c/projects</code></pre><p>Then I set my $GOPATH to &quot;/mnt/c/projects&quot; and Go worked beautifully from WSL.  I also installed Go on Windows and set my GOPATH to &quot;C:\\projects&quot;, which is the same folder.  Now I have one folder accessible to both WSL and Windows. Because Go stores compiled libraries in a folder named after the architecture under &quot;$GOPATH/pkg&quot;, I can compile from both Windows and Linux without overwriting any object files or binaries.  </p>\n<blockquote>\n<p>That&#39;s pretty damn nice.</p>\n</blockquote>\n<p>On the Windows side, I installed Visual Studio Code and set it up to use the Windows installation of Go for all the tooling required by the VSCode plugin for Go.   The only change to my VS Code configuration file was to specify the global $GOPATH:</p>\n<pre><code>{\n    &quot;go.gopath&quot;: &quot;c:\\\\projects&quot;\n}</code></pre><p>This setup uses the Windows Go installation to do code linting and other niceties that the VS Code Go plugin provides.  It also allows me to switch Go toolsets easily between Windows and Linux.  To build in Windows, I just open Powershell.  To build in Linux, I open a WSL prompt.   90% of the time, I&#39;m using Neovim in WSL anyway, but it&#39;s really nice to have VS Code working on the same files.  It&#39;s also really nice to be able to build and test an app in Windows easily.</p>\n<h3 id=\"docker\">Docker</h3>\n<p>I installed Docker for Windows, and installed the &quot;docker&quot; command in WSL.  To let Docker work against the Windows installation, I needed to export &quot;DOCKER_HOST&quot; in my .bashrc</p>\n<pre><code>export DOCKER_HOST=tcp://127.0.0.1:2375</code></pre><p>It&#39;s also necessary to tell Docker for Windows to listen on TCP:\n<img src=\"/images/2017/09/dockersettings.png\" alt=\"dockersettings\"></p>\n<p>Now Docker works from both Windows and WSL.  All my code and scripts that expected a local Docker instance continue to work as they did when I was developing directly on a Linux host.</p>\n<h3 id=\"the-kicker\">The Kicker</h3>\n<p>The Surface Laptop is an awesome little machine.  It is roughly the same size as a MacBook Air, but it has a full touch screen that allows you to use the Surface Pen to draw.  The sound is fantastic; some of the best speakers I&#39;ve ever heard on a laptop.  The keyboard is comfortable, and the cool fuzzy leather keyboard cover is comfortable and prevents that awful pain many of us experience when resting your hands on a MacBook for too long -- from those sharp edges on the case.</p>\n<p>But maybe most exciting is using the Surface Laptop with the <a href=\"https://www.microsoft.com/en-us/store/d/microsoft-surface-dock/8qrh2npz0s0p/hpr1?OCID=AID620866_SEM_WcsVqgAABYJtT8Nn%3a20170929022339%3as\">Surface Dock</a>.  The dock has several USB ports, two mini Display Port ports, and audio out.  When I want to work at my desk, I just plug the single (slightly awkward) dock plug in to the side of the laptop and close the lid.  I get my nice WASD Code mechanical keyboard, a big 4k monitor, and all the comforts of working on a desktop.  Reliable and easy docking is something I missed terribly in both Linux laptops and macOS.  Single plug, simple docking experience.  I love this probably most of all.</p>\n<h3 id=\"summary\">Summary</h3>\n<p>None of this is revolutionary, but the setup as a whole makes me happy.  I have all the comforts of a consumer-grade operating system (Windows), so I can easily use Skype, Slack, Microsoft Teams, Outlook, etc without fighting to install them on Linux, or worse -- settling for a nasty web interface. \nI also have all the benefits of a full Linux development environment.  I can use &quot;apt&quot; to install any packages I want, I use Neovim, all my dotfiles work perfectly in WSL.  It&#39;s a full Linux development environment without a VM.\n<strong>This setup has enabled me to go down to a single computer for my day-to-day usage.</strong>  Only one computer on my desk now, instead of the three that were there before.   I haven&#39;t turned on my MacBook Pro in almost a week. </p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "development",
        "linux",
        "windows"
      ],
      "date": "2017-09-29T02:25:44Z",
      "description": "",
      "images": [
        "/images/2017/09/desktop.png"
      ],
      "slug": "my-cross-platform-dev-setup-on-surface-laptop",
      "tags": [
        "development",
        "linux",
        "windows"
      ],
      "title": "My Cross-Platform Dev Setup on Surface Laptop",
      "excerpt": "<p>I want to document a setup that I&apos;ve found that works really well for me using Windows 10 and <a href=\"https://blogs.msdn.microsoft.com/wsl/2016/04/22/windows-subsystem-for-linux-overview/\">Windows Subsystem for Linux</a> for general development.  Before we dive into any specifics, though, I want to provide some background and explain my objectives which will help to frame the decisions I&apos;ve made and the trade-offs chosen to reach a more ideal environment.</p>",
      "meta": {
        "relativePath": "posts/my-cross-platform-dev-setup-on-surface-laptop.html",
        "createdAt": "2020-11-05T00:09:03.790Z",
        "lastModified": "2020-11-05T00:09:03.790Z",
        "size": 8173,
        "formattedSize": "8.0 KB"
      }
    },
    {
      "id": "posts__new-tricks",
      "contents": "<p>I promised <a href=\"https://brianketelsen.com/opensource/\">here</a> that I would document my progress learning frontend development.  This isn&#39;t a book-length treatise on the subject, but I do have a few notes about my progress.  </p>\n<!-- more -->\n\n<p>It&#39;s been a little overwhelming going from zero to having an idea about what I&#39;m doing.  Many other people have mentioned it, so I won&#39;t belabor the point -- the Javascript ecosystem is huge and confusing.  Seriously.</p>\n<blockquote>\n<p>I played with several different frameworks with varying results.  I&#39;m not sure whether my success and/or appreciation of the frameworks is based on my bias and previous learnings, but some are much easier than others to pick up.</p>\n</blockquote>\n<ul>\n<li>React - I really like React as a concept -- at least what I <em>understand</em> of the concept of React.  I have had the most success with React, and accomplished the most here. I really love mixing inline markup with code.  That&#39;s nice and feels comfortable.  Seems like there are too many ways to put together a React project and it felt like the heaviest of all of the things I tried.  Still probably my favorite, though.</li>\n<li>Polymer - The Polymer project appeals to me because of the nice UI components, but I had a harder time here due to the lack of documentation and sample projects that I can learn from.  I still had moderate success, but it wasn&#39;t as easy to understand as React was, especially around how to tie things together using events.</li>\n<li>Vue.js - Vue.js looks nice, but I disliked the strange decoration syntax, which reminds me a bit of Angular.  I tried a little &quot;hello world&quot; app and abandoned it due to my distaste for the syntax and concepts.</li>\n<li>Mithril - This one looks really promising, and felt the &quot;lightest&quot; of all of the frameworks I tried.  I really disliked the process of assembling the views with javascript functions rather than inline markup (React style).  That feels so clunky. Maybe there is a way to use templates, I didn&#39;t investigate enough.</li>\n</ul>\n<p>Overall, I did make quite a bit of progress on the Javascript side of the equation.  I&#39;ll keep experimenting and learning.  I know I said I wouldn&#39;t belabor the point, but do we really need NPM, Webpack, Grunt, Gulp, Bower and all the rest of this mess just to build a web app?  I am really unsure of what each of them is supposed to do and where they fit -- which are complementary and which aren&#39;t.  Seems strange to have a project with bower dependencies and npm dependencies vendored in two different folders.  And I never did figure out by looking at the configuration files how the app knows where to find those vendored libraries.  Too much magic.</p>\n<p>As I get more comfortable, I think I&#39;d like to try doing some things with just jQuery or backbone.js - something much lighter and farther down the framework stack to see how it feels.  Would love recommendations if you have any.  </p>\n<p>It hasn&#39;t been as hard as I thought it would be.  It hasn&#39;t really been <em>fun</em> either, though.  I suspect with time I&#39;ll be more comfortable and I continue to press myself to learn.  Thanks for following along.</p>\n<p>Post Script:\nI&#39;ve done each of these test projects using either Javascript or TypeScript, but where possible I also did a version using <a href=\"http://www.gopherjs.org\">GopherJS</a> which I found to be really fun.  I have decided not to do my learning using GopherJS because it is an additional layer of translation that is causing me more mental load than it should.  I really love that project though, and when I&#39;m feeling stronger in the JS world, I&#39;ll move back to GopherJS because it still feels like home.  The people in the GopherJS community have been awesome - Luna Duclos, Dominik Honnef, Dmitri Shuralyov, and Bjorn Erik Pedersen have had a tremendous amount of patience with me.  Many thanks!</p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "frontend",
        "javascript"
      ],
      "date": "2016-05-04T22:59:00Z",
      "description": "",
      "images": [
        "https://images.unsplash.com/photo-1485873402302-54d29627d4dc?ixlib=rb-0.3.5&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=1080&fit=max&s=92fef24305267cc33dca74cb14d58118"
      ],
      "slug": "new-tricks",
      "tags": [
        "frontend",
        "javascript"
      ],
      "title": "New Tricks - notes as I learn modern front-end development",
      "excerpt": "<p>I promised <a href=\"https://brianketelsen.com/opensource/\">here</a> that I would document my progress learning frontend development.  This isn&apos;t a book-length treatise on the subject, but I do have a few notes about my progress.  </p>",
      "meta": {
        "relativePath": "posts/new-tricks.html",
        "createdAt": "2020-11-05T00:09:34.000Z",
        "lastModified": "2020-11-05T00:09:34.000Z",
        "size": 4183,
        "formattedSize": "4.1 KB"
      }
    },
    {
      "id": "posts__old-dogs",
      "contents": "<p>For 15 or more years I have told myself that I can&#39;t do frontend web work.  I remember seeing a presentation from a co-worker on CSS in 2003 or so, and thinking it was just too complicated.  I&#39;ve always been the guy behind the scenes building the services that power the web, but never the one spending any time making them less ugly.<!-- more --></p>\n<p>I know basic HTML -- from the roughly the <a href=\"http://www.yourhtmlsource.com/starthere/historyofhtml.html\">HTML 4.01 era</a>. My excuse has always been that this is enough to create the sort of user interfaces I&#39;ve been required to create.  Simple admin screens, simple tabular reports, those sorts of things.  I was able to avoid learning any more complex frontend skills over the years by simply shrugging and saying &quot;I don&#39;t know frontend&quot;. </p>\n<p>I&#39;ve recently started working on <a href=\"https://github.com/gopheracademy/congo\">Congo</a> again, in an effort to simplify the piles of spreadsheets, notes, emails, and TODO lists that pile up on conference organizers. Congo will provide an API for clients to consume, and will require a web interface for management. It&#39;s time to finally buckle down and learn some basic frontend development skills.</p>\n<p>I&#39;m not trying to minimize my abilities, or pretend that I have <em>no</em> capabilities. I&#39;ve made modifications to existing React and Angular applications before. I&#39;ve changed and tweaked a few CSS styles to get a desired effect. But it&#39;s not a place that I&#39;m comfortable, and not a place I can start from scratch. I need someone else to set it up and do the hardwork so I can make the small changes. So you can think of me as a Junior Frontend Developer, but without the hoodie and expensive coffee. </p>\n<p>I know that there is nothing preventing me from being a capable frontend developer other than my own bias and laziness. So today I&#39;m making the commitment to learn more. I&#39;ll be writing about it here, so follow along and enjoy the laughs. If you have tips and tricks - send them to me on <a href=\"https://twitter.com/bketelsen\">twitter</a> or follow me there for regular updates.</p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "frontend",
        "javascript",
        "css"
      ],
      "date": "2016-06-13T23:02:00Z",
      "images": [
        "https://images.unsplash.com/photo-1476873064915-2f5cde044a5d?ixlib=rb-0.3.5&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=1080&fit=max&s=403bd5632c18b38d3586b6e7e46741b2"
      ],
      "slug": "old-dogs",
      "tags": [
        "frontend",
        "javascript",
        "css"
      ],
      "title": "Old Dogs, New Tricks, and Cognitive Bias",
      "excerpt": "<p>For 15 or more years I have told myself that I can&apos;t do frontend web work.  I remember seeing a presentation from a co-worker on CSS in 2003 or so, and thinking it was just too complicated.  I&apos;ve always been the guy behind the scenes building the services that power the web, but never the one spending any time making them less ugly.<!-- more --></p>",
      "meta": {
        "relativePath": "posts/old-dogs.html",
        "createdAt": "2020-11-05T00:09:44.300Z",
        "lastModified": "2020-11-05T00:09:44.300Z",
        "size": 2458,
        "formattedSize": "2.4 KB"
      }
    },
    {
      "id": "posts__one",
      "contents": "<p>Every blog starts with a single post. This is yours. Make it great.</p>\n<!-- more -->\n\n<p>This post intentionally left blank.</p>\n<p>Write what you want.</p>\n",
      "title": "Hello World 👋",
      "date": "2019-06-11T08:38:00.000Z",
      "slug": "hello",
      "excerpt": "<p>Every blog starts with a single post. This is yours. Make it great.</p>",
      "meta": {
        "relativePath": "posts/one.html",
        "createdAt": "2020-11-04T21:02:04.780Z",
        "lastModified": "2020-11-04T21:02:04.788Z",
        "size": 219,
        "formattedSize": "219 Bytes"
      }
    },
    {
      "id": "posts__retractable-green-screen-on-the-cheap",
      "contents": "<p>Quick post to write up how I built a retractable green screen mount on my wall for not much money.</p>\n<!-- more -->\n\n<p>I bought a mounting bracket <a href=\"https://www.amazon.com/gp/product/B002P32990/ref=oh_aui_detailpage_o02_s01?ie=UTF8&amp;psc=1\">from Amazon</a> that was intended for paper photograph backrounds like this.  I didn&#39;t want paper, I wanted muslin for it&#39;s superior light disbursement and durability.  I already had a 9&#39; by 15&#39; muslin green screen backdrop similar to <a href=\"https://www.amazon.com/gp/product/B017WNJS3M/ref=oh_aui_detailpage_o02_s00?ie=UTF8&amp;psc=1\">this one</a>.</p>\n<p>When the mounting bracket arrived, it said to use a metal rod with a 2&quot; (two inch) inner diameter.  I didn&#39;t want to use anything that heavy, so I went to Lowes and found PVC pipe with 2&quot; inner diameter and bought a 10 foot section.</p>\n<p>Then I measured the target wall and found it was 11.5 feet wide, perfect for my install.  I did the math to center the mount on the wall, accounting for the several inches of the pole-mount that stick out from each side.</p>\n<p><img src=\"/images/2018/10/IMG_1378.jpeg\" alt=\"Triple Bracket Mounted On The Wall\"></p>\n<p>Then to secure the backdrop to the PVC tubing, I reinforced the backdrop with Gorilla tape every 12 inches.  Duct tape or any other strong tape would work fine.  I drilled a hole through the reinforced backdrop and inserted a wood screw and washer to keep the backdrop secured to the PVC pipe.</p>\n<p><img src=\"/images/2018/10/IMG_1381.jpg\" alt=\"Reinforced Fabric with Gorilla Tape\"></p>\n<p>The whole thing took about an hour, mostly because it was awkward working with such a wide format project.  I called my kids in randomly to help when I needed an extra set of hands.</p>\n<p><img src=\"/images/2018/10/IMG_1380.jpeg\" alt=\"Final Assembly\"></p>\n<p>It was really inexpensive, and I can add two more backdrops in the future if the need arises.  Far better than the $1500+ solutions I found at photography stores, and much less intrusive than the nasty stands that take up too much floor space.</p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "hacks"
      ],
      "date": "2018-10-06T18:20:43Z",
      "images": [
        "/images/2018/10/IMG_1380-1.jpeg"
      ],
      "slug": "retractable-green-screen-on-the-cheap",
      "tags": [
        "hacks"
      ],
      "title": "Retractable Green Screen On the Cheap",
      "excerpt": "<p>Quick post to write up how I built a retractable green screen mount on my wall for not much money.</p>",
      "meta": {
        "relativePath": "posts/retractable-green-screen-on-the-cheap.html",
        "createdAt": "2020-11-05T00:10:13.110Z",
        "lastModified": "2020-11-05T00:10:13.110Z",
        "size": 2184,
        "formattedSize": "2.1 KB"
      }
    },
    {
      "id": "posts__open-source-appreciation",
      "contents": "<p>I&#39;ve never been shy about sharing my love for Open Source.  I love creating things, and I love sharing them with others.  One of my particular joys with Open Source Software, however, is finding new projects that excite me.<!-- more --></p>\n<p>I generally get excited about new OSS projects for two reasons:</p>\n<ol>\n<li>It does something I want or need to do</li>\n<li>It is written in a way that allows or encourages me to learn something new</li>\n</ol>\n<p>The first is obvious... when I&#39;ve got a project to complete and it makes sense to use an open source component, it&#39;s my first preference.  I&#39;m always happy when someone else has thought through the hard parts and done the work to make a quality project and share it with the world.  I truly enjoy contributing to these projects too.  Some developer scratched an itch she had and shared it with the world, now I get to help make it better.  That&#39;s just winning for everyone.</p>\n<p>The second reason I get excited is when I find a project that teaches me something.  This happened a few days ago with <a href=\"http://goa.design\">goa</a>.  Two things about <code>goa</code> excited me.  It is a very well written DSL in Go, and it uses Go&#39;s <code>net/context</code> library in an unusual way.  I say &quot;unusual&quot;, but after studying <code>goa</code> more I&#39;ve come to the conclusion that I&#39;ve only been using <code>net/context</code> at half it&#39;s capability in my past projects.  The author of goa -- Raphael Simon\nfrom RightScale -- is using contexts to their full potential.  Learning from this code is making me a better programmer.</p>\n<p>I spent the next few days shouting from the mountain tops about my newfound love for <code>goa</code>.  Anybody who follows me on Twitter can attest to this.</p>\n<blockquote class=\"twitter-tweet\" lang=\"en\"><p lang=\"en\" dir=\"ltr\">This repo should have a thousand stars by now: <a href=\"https://t.co/iSsQeEAC03\">https://t.co/iSsQeEAC03</a> <a href=\"https://twitter.com/hashtag/golang?src=hash\">#golang</a></p>&mdash; Brian Ketelsen (@bketelsen) <a href=\"https://twitter.com/bketelsen/status/666697133437923328\">November 17, 2015</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<blockquote class=\"twitter-tweet\" lang=\"en\"><p lang=\"en\" dir=\"ltr\">So I spent a few hours converting an internal API to goa (<a href=\"https://t.co/EYoAB1wTeV\">https://t.co/EYoAB1wTeV</a>) and I think I want to marry the guy who wrote it.</p>&mdash; Brian Ketelsen (@bketelsen) <a href=\"https://twitter.com/bketelsen/status/666786731807662081\">November 18, 2015</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>I was talking with Matt Holt, author of another of my favorite open source projects <a href=\"https://caddyserver.com\">Caddy</a>, and our discussion evolved into the various ways we like to show appreciation for software projects we like and use.  I&#39;ve told Matt dozens of times how much I love and appreciate Caddy.  And I believe that he enjoys hearing it.  Some of the ways of showing appreciation we listed:</p>\n<ol>\n<li><p>Open an issue on the GitHub repository with a quick thank you note.  &quot;No problem with your software, just wanted to let you know I&#39;m using it and love it.&quot; or &quot;I really love the way you solved X problem by doing Y, I learned a lot, thanks!&quot;   I do this frequently and it&#39;s always received well.</p>\n</li>\n<li><p>Send the author(s) a thanks on Twitter if you know their Twitter handle.  Simple and direct, and who doesn&#39;t love hearing that someone is using their project?</p>\n</li>\n<li><p>If the project has a developer mailing list or IRC/Slack/Gitter channel, pop in and say the same thing.</p>\n</li>\n<li><p>Write a blog post about the software/project and how you use it or why you like it.  I set up Google News Alerts on new projects and it&#39;s always a treat when I get an email from Google listing a blog post about one of my projects. </p>\n</li>\n</ol>\n<p>I&#39;m sure you can think of dozens of other ways to show your appreciation for the Open Source Software you use.  None of them are particularly burdensome or time consuming.  And they almost always have a postive impact.</p>\n<p>I&#39;d like to propose a new hash tag on Twitter:  <em>#freesoftwarefriday</em></p>\n<p>Let&#39;s start showing more appreciation to the people who put hard work into projects that we use.  If you use a gem, egg, package, project, script, or any other Open Source code, take a moment on each Friday to give a shout out to that project or the maintainers.  I&#39;d venture a guess that most OSS project owners would be delighted to see them or their project mentioned.  It might even give them the encouragement to create more projects, or add more features.  OSS can be a thankless\njob sometimes.  Anyone who has released OSS code knows that there&#39;s a burden of time and a psychological burden that goes along with releasing code.  A kind word to the author might lessen that burden a bit.  You might just make someone&#39;s day.</p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "open source"
      ],
      "date": "2015-05-11T23:03:00Z",
      "description": "",
      "images": [
        "https://images.unsplash.com/photo-1442504028989-ab58b5f29a4a?ixlib=rb-0.3.5&q=80&fm=jpg&crop=entropy&cs=tinysrgb&w=1080&fit=max&s=983d1bcc49709c385952e95ecad5f5d5"
      ],
      "slug": "open-source-appreciation",
      "tags": [
        "open source"
      ],
      "title": "Open Source Appreciation",
      "excerpt": "<p>I&apos;ve never been shy about sharing my love for Open Source.  I love creating things, and I love sharing them with others.  One of my particular joys with Open Source Software, however, is finding new projects that excite me.<!-- more --></p>",
      "meta": {
        "relativePath": "posts/open-source-appreciation.html",
        "createdAt": "2020-11-05T00:09:56.370Z",
        "lastModified": "2020-11-05T00:09:56.370Z",
        "size": 5176,
        "formattedSize": "5.1 KB"
      }
    },
    {
      "id": "posts__switchers",
      "contents": "<p>TLDR; I&#39;ve traded in my Mac on a Surface Pro.  Here&#39;s why:<!-- more --></p>\n<p>I&#39;ve been whining about Apple and the way they&#39;ve ignored the power users for quite some time now.  I&#39;ve been using Linux for development for several years, and always wanted a way to run Linux as my primary OS.  But the sad truth (for me) is that there are just some things that prevent me from using Linux as my full time operating system.  Email might be the biggest, but there are other apps that are missing or just sub-par.</p>\n<p>MacOS was always &quot;close-enough&quot; to Linux that most things worked well.  Docker made things a little more difficult initially, then a little better with the new Docker for Mac.  But it still wasn&#39;t Linux, and it&#39;s hard to argue that developing on the platform you ship to is the right choice.  The OS itself is still visually superior to anything else, but it&#39;s been showing the signs of neglect for a few years now.  It&#39;s clear from Apple&#39;s recent announcements that they are a mobile OS/hardware company that happens to sell computers too.  They&#39;re not sad to lose me, I&#39;m sure.  </p>\n<p>My article in July about <a href=\"/blog/i3-windows/\">Windows Subsystem for Linux</a> hinted at my excitement about being able to run a solid desktop OS but still do the open source sort of development that really needs to be done on a Linux type operating system.  I abandoned that effort in July because it was still too alpha quality.  Too many things didn&#39;t work.  But it&#39;s November now, several builds later and Microsoft is shipping Ubuntu 16.04.1 in the latest Windows Insider releases.</p>\n<p>I took the plunge and bought a Surface Pro 4 when Microsoft announced the trade in program (still good until the 10th of November I think...) to give up to $650 off of a Surface device.  This Surface is just the right size for an airplane tray, has an i7 and 16GB of RAM, and most importantly the Linux subsystem just works for the most part.  I haven&#39;t done anything yet that failed.  I&#39;m sure there are still things that won&#39;t work, but for my primary use -- writing Go applications, teaching Kubernetes and Go, hacking on open source projects -- it all works.</p>\n<p>I was even able to run i3 Window manager again.  No flaws, no errors.  Windows has solid email and calendar applications, and let&#39;s face it; Chrome is Chrome on every OS, and we spend more time there than any other app besides the terminal.  SPEAKING OF THE TERMINAL, Microsoft has done some serious house cleaning there.  The terminal is fast, has true color support, transparency, auto layout correction on resizing, who knows what else has been fixed under the covers?  It&#39;s 80% of what you&#39;d expect from gnome-terminal.  And that&#39;s a far cry from the old CMD.exe days.</p>\n<p>I don&#39;t expect to be running X Windows often, when I&#39;m deep in a hacking session I&#39;ll probably open up i3 window manager, it&#39;s still the most productive way to code.  Neovim and vim-go work perfectly in Windows bash, so it&#39;s not a stretch to think I could just have a couple of bash windows open and alt-tab between them.  SSH and SCP work perfectly, and I can still cross-compile Go binaries for any platform (like my Raspberry Pi for my bbq app!). </p>\n<p>The most amazing part of all of this is that I simply git cloned my <a href=\"https://github.com/bketelsen/dotfiles\">dotfiles</a> from my Ubuntu installs and ran them un-altered.  It&#39;s the same experience, but without the hardware headaches that Linux always brings, nor the lack of good quality applications.  </p>\n<hr/>\nI think Apple has lost its hunger, and Microsoft found it.  The tables have turned from the funny switching campaigns with Justin Long looking hip and making fun of the frumpy John Hodgman.  Today's Microsoft is a completely different animal.  They're contributing heavily to open source projects, they've opened up the .Net platform, they're embracing developers and open source enthusiasts openly while Apple counts dollar bills from iPhone sales in a vault in Switzerland somewhere.\n\n<p>I got a lot of amused responses on Twitter when I announced my switch.  This environment may not yet be perfect, but my bet is on Microsoft for the future.  I&#39;m surprised to be saying that, but the evidence is clear that Apple isn&#39;t the company it was under Steve Jobs.  And Microsoft isn&#39;t the company it was under Balmer.  The irony hurts.  </p>\n<p><a href=\"https://en.wikipedia.org/w/index.php?curid=26608065\">image credit wikipedia</a></p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "hacks",
        "i3",
        "windows",
        "linux",
        "mac"
      ],
      "date": "2016-11-07T00:07:00Z",
      "images": [
        "/images/2017/09/getamac.png"
      ],
      "slug": "switchers",
      "tags": [
        "hacks",
        "i3",
        "windows",
        "linux",
        "mac"
      ],
      "title": "Switching - Irony and Operating systems",
      "excerpt": "<p>TLDR; I&apos;ve traded in my Mac on a Surface Pro.  Here&apos;s why:<!-- more --></p>",
      "meta": {
        "relativePath": "posts/switchers.html",
        "createdAt": "2020-11-05T00:10:44.740Z",
        "lastModified": "2020-11-05T00:10:44.740Z",
        "size": 4682,
        "formattedSize": "4.6 KB"
      }
    },
    {
      "id": "posts__tastyworms",
      "contents": "<p>A coworker sent me a link to this recipe and I have to share it.  It&#39;s the tastiest looking sandworm ever.</p>\n<!-- more -->\n<p><a href=\"http://kitchenoverlord.com/2015/12/03/dune-week-spice-filled-sandworm/\">Spice Filled Sandworm</a></p>\n<p>If you make one let me know... Looks delicious.  Blessed be the maker.</p>\n<p><em>image courtesy of kitchenoverlord.com</em></p>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "dune",
        "recipes"
      ],
      "date": "2015-12-05T00:08:00Z",
      "images": [
        "/images/2017/09/sandworm-bread-03.jpg"
      ],
      "slug": "tastyworms",
      "tags": [
        "dune",
        "recipes"
      ],
      "title": "Tasty Worms",
      "excerpt": "<p>A coworker sent me a link to this recipe and I have to share it.  It&apos;s the tastiest looking sandworm ever.</p>",
      "meta": {
        "relativePath": "posts/tastyworms.html",
        "createdAt": "2020-11-05T00:10:57.300Z",
        "lastModified": "2020-11-05T00:10:57.300Z",
        "size": 556,
        "formattedSize": "556 Bytes"
      }
    },
    {
      "id": "posts__two",
      "contents": "<p>Every blog starts with a single post. This is yours. Make it great.</p>\n<!-- more -->\n\n<p>This post intentionally left blank.</p>\n<p>Write what you want.</p>\n",
      "title": "Goodbye World 👋",
      "date": "2019-06-11T08:38:00.000Z",
      "slug": "goodbye",
      "excerpt": "<p>Every blog starts with a single post. This is yours. Make it great.</p>",
      "meta": {
        "relativePath": "posts/two.html",
        "createdAt": "2020-11-04T19:46:46.790Z",
        "lastModified": "2020-11-04T19:46:46.790Z",
        "size": 223,
        "formattedSize": "223 Bytes"
      }
    },
    {
      "id": "posts__vscode-remote",
      "contents": "<p>The <a href=\"https://code.visualstudio.com/\">Visual Studio Code</a> team just <a href=\"https://cda.ms/RN\">announced</a> perhaps the most eagerly anticipated feature yet.  Remote editing.</p>\n<!-- more -->\n<p><a href=\"https://www.twitch.tv/videos/419428954##\">Twitch Stream - Mac to SSH</a>\n<a href=\"https://www.twitch.tv/videos/419800747\">Twitch Stream - WSL &amp; Containers</a></p>\n<h3 id=\"remote-editing\">Remote Editing</h3>\n<p>An <a href=\"https://aka.ms/VSCodeRemoteExtensionPack\">extension pack</a> was released today that consists of three related extensions to Code.</p>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-wsl\">Remote - WSL</a></li>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-containers\">Remote - Container</a></li>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-ssh\">Remote - SSH</a></li>\n</ul>\n<p>These extensions enable development from a local VS Code instance against a remote environment.  And they&#39;re a dream come true for me.</p>\n<p>Each of these extensions allows you to run VS Code on <code>some computer</code> but the code and tools are on <code>some other compute device</code>.</p>\n<h4 id=\"remote---wsl\">Remote - WSL</h4>\n<p>If you&#39;re a Windows user, you know the frustration of working on a project that expects to be developed in Linux.  There are hacks and workarounds for using VS Code in Windows and keeping the development tools in WSL, but the <a href=\"https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-wsl\">remote-wsl</a> extension solves this problem officially.  You use Code in Windows, but the dev tools and environment live in WSL.  Talk about the best of both worlds!</p>\n<h4 id=\"remote---container\">Remote - Container</h4>\n<p>With the <a href=\"https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-containers\">remote-containers</a> plugin, you add a Dockerfile and a configuration file to your project and VS Code will automatically prompt you to spin up the container as your development environment.  It will mount your code inside the container, and run as if you are developing inside the target environment. </p>\n<p>This is the <code>perfect</code> way to ship a pre-configured development environment for an Open Source project, for example.  I&#39;m really excited to add this to several of my projects.</p>\n<h4 id=\"remote---ssh\">Remote - SSH</h4>\n<p>Of the three, I will probably use this one the most.  In fact I&#39;m using it to write this blog post.</p>\n<p><img src=\"/images/remotessh.png\" alt=\"remote-ssh\"></p>\n<p>The <a href=\"https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-ssh\">remote-ssh</a> extension uses an SSH client on the host to communicate with a remote computer.  If you have a beefy development machine (either locally or in the cloud), this is the perfect way to keep your development experience stable no matter what computer you&#39;re sitting at.  No more syncing unfinished code between machines for me.</p>\n<p>The extension even does port forwarding over your ssh connection.  When you start your website or service, it will forward that port for you to the local machine.</p>\n<p><img src=\"/images/remotemenu.png\" alt=\"remote-menu\"></p>\n<p>I&#39;ve been using the preview version of these three extensions for a few weeks now, and I couldn&#39;t be happier with the setup.  I&#39;ve used them from a Mac, from a Chromebook with Crostini, from Linux, and from Windows.  It works equally well across all platforms.</p>\n<p>Go forth and remotely develop!</p>\n",
      "title": "VS Code Remote Development",
      "layout": "post",
      "date": "2019-05-02",
      "slug": "vscode-remote-development",
      "images": [
        "/images/fpoHihXiMhg.jpg"
      ],
      "thumbnail": "/images/fpoHihXiMhg-thumb.jpg",
      "credit": "https://unsplash.com/photos/fpoHihXiMhg",
      "description": "Use VS Code against a remote computer or container",
      "tags": [
        "vscode",
        "development"
      ],
      "classes": [
        "feature-hyphenate",
        "feature-justify",
        "feature-highlight"
      ],
      "categories": [
        "Development"
      ],
      "excerpt": "<p>The <a href=\"https://code.visualstudio.com/\">Visual Studio Code</a> team just <a href=\"https://cda.ms/RN\">announced</a> perhaps the most eagerly anticipated feature yet.  Remote editing.</p>",
      "meta": {
        "relativePath": "posts/vscode-remote.html",
        "createdAt": "2020-11-05T00:11:09.200Z",
        "lastModified": "2020-11-05T00:11:09.200Z",
        "size": 3652,
        "formattedSize": "3.6 KB"
      }
    },
    {
      "id": "posts__ssh-to-wsl2",
      "contents": "<p>In this article I share my learnings on remotely accessing your Windows 10 computer. My motivation was to determine efficient ways to access both the Windows environment, and the WSL2 development environment from another computer.</p>\n<!-- more -->\n\n\n<h2 id=\"remote-access-for-new-windows-users\">Remote Access for New Windows Users</h2>\n<p>Find other articles in this series <a href=\"/tags/30daywslchallenge/\">with this link</a>.</p>\n<p>For emphasis in this article, many of the screenshots are taken from my iPad Pro accessing my desktop computer running Windows 10 and WSL2.</p>\n<h3 id=\"windows\">Windows</h3>\n<p>Accessing a Windows computer remotely is extremely simple and performant compared to options for macOS and Linux. Windows users have long enjoyed the <a href=\"https://docs.microsoft.com/en-us/windows/win32/termserv/remote-desktop-protocol\">Remote Desktop Protocol</a>. An over-simplified description of the RDP protocol would state that it encodes user interface changes as network packets and sends them to the client. RDP has hooks deep into the operating system, so it&#39;s a very efficient protocol. On the same local network, an RDP connection is nearly indistinguishable from a local login. Even over the internet, or a VPN, RDP is extremely usable. </p>\n<h4 id=\"enabling-remote-desktop\">Enabling Remote Desktop</h4>\n<p>To enable RDP, go to <code>Start &gt; Settings &gt; System &gt; Remote Desktop</code>, and enable the slider.</p>\n<p><img src=\"/images/wsl/rdp.png\" alt=\"Remote Desktop\"></p>\n<p>If you intend to connect from a client that isn&#39;t running Windows (like my iPad, for example) you&#39;ll also want to click the <code>Advanced Settings</code> link and disable Network Level Authentication. This reduces security slightly, so be sure to research the implications and assess your risk before exposing your computers over untrusted networks. My desktop is only available on my local network, or when I use the VPN I&#39;ve created on my Unifi Edge Router.</p>\n<p><img src=\"/images/wsl/nla.png\" alt=\"Network Level Auth\"></p>\n<p>That&#39;s all you need to do on the host side. On the client, grab a Remote Desktop Client from whichever App Store or software source you usually use for downloads.  On my iPad I searched for &quot;Remote Desktop&quot; in the App Store, and downloaded the official Microsoft remote desktop client.</p>\n<p>To connect, find your host&#39;s IP address and configure the remote desktop client to connect by IP address.</p>\n<h3 id=\"wsl2\">WSL2</h3>\n<p>Here&#39;s where the fun starts.  I&#39;m quite used to connecting to my development environments via ssh. When I moved to Windows, that seemed like something I&#39;d have to give up because it didn&#39;t look possible.  Then I stumbled on a <a href=\"https://community.ui.com/questions/UNMS-running-on-Windows-10-Subsystem-Linux-2-WSL2/552f3b66-c1f0-41f1-8aa5-f2e6e0f56a5a\">post</a> on the Unifi forums that mentioned a Windows command I vaguely remember from 15 years ago.  <code>netsh</code></p>\n<p>Start by installing the package <code>openssh-server</code>.  Then edit <code>/etc/ssh/sshd_config</code> to change the <code>Listen</code> port to something other than 22.  I set mine to <code>2222</code>.</p>\n<pre><code>❯ cat /etc/ssh/sshd_config\n#       $OpenBSD: sshd_config,v 1.101 2017/03/14 07:19:07 djm Exp $\n\n# ... snipped lines ...\nPort 2222\n\n# ... more snipped lines ...\nPasswordAuthentication no</code></pre><p>I also set <code>PasswordAuthentication</code> to <code>no</code>, which means I&#39;ll be using SSH keys to authenticate.  Put authorized public keys in <code>~/.ssh/authorized_keys</code> in order to use this setting.  If you don&#39;t allow Password Authentication, you have to have keys setup, so don&#39;t enable this without understanding what&#39;s going on.</p>\n<p>Now, using <code>netsh</code> I can port forward connections from Windows to the VM that&#39;s running WSL2.  To do this you&#39;ll need to get the IP address of your WSL2 instance.  <code>ip addr</code> or <code>ifconfig</code> should do the trick.  Mine is <code>172.19.149.102</code>, so the PowerShell command to forward port 2222 from Windows to my WSL2 instance is this:</p>\n<pre><code>netsh interface portproxy add v4tov4 listenport=2222 listenaddress=0.0.0.0 connectport=2222 connectaddress=172.19.149.102</code></pre><p>Finally I had to allow port 2222 through the Windows Firewall.  The simplest way to do this is using the advanced firewall configuration.</p>\n<p><img src=\"/images/wsl/firewall.png\" alt=\"Firewall Settings\"></p>\n<p>Then open the Advanced Firewall settings:</p>\n<p><img src=\"/images/wsl/advancefw.png\" alt=\"Advanced Firewall Settings\"></p>\n<p>Click &quot;Inbound&quot; in the left pane, then &quot;New...&quot; on the right pane.  Choose &quot;Port&quot;:</p>\n<p><img src=\"/images/wsl/port.png\" alt=\"Port\"></p>\n<p>Then specify port 2222:</p>\n<p><img src=\"/images/wsl/port2222.png\" alt=\"Port 2222\"></p>\n<p>Specify &quot;Allow&quot;</p>\n<p><img src=\"/images/wsl/allow.png\" alt=\"Allow\"></p>\n<p>Then uncheck &quot;Public&quot; when it asks which networks to apply these rules to.  If you&#39;re on a public network, we don&#39;t want anybody trying to get ssh access anywhere.</p>\n<h4 id=\"profit\">Profit</h4>\n<p>Now from anywhere on your LAN, you can ssh to the IP of your Windows computer on port 2222.  I used the Blink app on my iPad Pro and connected with the following command:</p>\n<pre><code>ssh -p 2222 bjk@192.0.1.100</code></pre><p>where the <code>192.0.1.100</code> is the IP address of my Windows machine.</p>\n<h3 id=\"update-august-2020\">Update August 2020</h3>\n<p>The failing of this method is that your WSL2 instance gets a new IP address each time it restarts. Based on several of the suggestions in <a href=\"https://github.com/microsoft/WSL/issues/4150\">this Github issue</a> I&#39;ve created a successful workaround.</p>\n<p>Start by using Windows Powershell ISE to create a new script called <code>WSL.ps1</code>.  I saved mine in the root of my User directory in Windows.  <code>C:\\Users\\me\\WSL.ps1</code> Add this script as the contents of the file then save it:</p>\n<pre><code>$remoteport = bash.exe -c &quot;ifconfig eth0 | grep &#39;inet &#39;&quot;\n$found = $remoteport -match &#39;\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}&#39;;\n\nif( $found  ){\n  $remoteport = $matches[0];\n\n} else{\n  echo &quot;The Script Exited, the ip address of WSL 2 cannot be found&quot;;\n    exit;\n\n}\n\n#[Ports]\n\n#All the ports you want to forward separated by comma\n$ports=@(2222);\n\n\n#[Static ip]\n#You can change the addr to your ip config to listen to a specific address\n$addr=&#39;0.0.0.0&#39;;\n$ports_a = $ports -join &quot;,&quot;;\n\n\n#Remove Firewall Exception Rules\niex &quot;Remove-NetFireWallRule -DisplayName &#39;WSL 2 Firewall Unlock&#39; &quot;;\n\n#adding Exception Rules for inbound and outbound Rules\niex &quot;New-NetFireWallRule -DisplayName &#39;WSL 2 Firewall Unlock&#39; -Direction Outbound -LocalPort $ports_a -Action Allow -Protocol TCP&quot;;\niex &quot;New-NetFireWallRule -DisplayName &#39;WSL 2 Firewall Unlock&#39; -Direction Inbound -LocalPort $ports_a -Action Allow -Protocol TCP&quot;;\n\nfor( $i = 0; $i -lt $ports.length; $i++  ){\n  $port = $ports[$i];\n    iex &quot;netsh interface portproxy delete v4tov4 listenport=$port listenaddress=$addr&quot;;\n      iex &quot;netsh interface portproxy add v4tov4 listenport=$port listenaddress=$addr connectport=$port connectaddress=$remoteport&quot;;\n\n}</code></pre><p>Next click on the Start menu and type <code>scheduler</code>. Open <code>Task Scheduler</code>.</p>\n<p>In the right side menu bar, select <code>Create Task</code>. Give it a name (I chose &#39;WSL&#39;), then choose the <code>triggers</code> tab. Select &#39;At Log On&#39; for the trigger, and &#39;for any user&#39;.</p>\n<p>Now go to the <code>Actions</code> tab and create a new action. Choose <code>Start a program</code>, type <code>powershell.exe</code> as the program name, then type <code>-ExecutionPolicy Bypass c:\\Users\\me\\WSL.ps1</code> in the &#39;arguments&#39; box. Ensure that the path to the script file is correct based on where you saved the script above.</p>\n<p>I&#39;ve also added a few lines to the end of my <code>.bashrc</code> to ensure <code>ssh</code> is running:</p>\n<pre><code class=\"language-bash\">SERVICE=&#39;ssh&#39;\n\nif ps ax | grep -v grep | grep $SERVICE &gt; /dev/null\nthen\n    echo &quot;$SERVICE service running.&quot;\nelse\n    sudo /etc/init.d/ssh start\nfi</code></pre>\n<p>I&#39;ll probably extract that out into a bash function called <code>ensure</code> so I can use it for more than this task.</p>\n<h4 id=\"extra-credit\">Extra Credit</h4>\n<p>For extra credit you can set up port forwarding on your internet router to forward to this same service. I picked a random high port (like 28945), and set up port forwarding from that port to port 2222 on my Windows machine.  Because it&#39;s an uncommon port, it won&#39;t get the usual SSH bot scanning traffic, and I don&#39;t have root login or password authentication enabled in the ssh daemon configuration.  So I feel relatively good about the security risk.  Be sure to understand your security profile before undertaking something like this.</p>\n<h2 id=\"references-and-further-information\">References and Further Information</h2>\n<ul>\n<li><a href=\"https://wsl.dev\">WSL Tips and Tricks</a></li>\n<li><a href=\"https://github.com/sirredbeard/Awesome-WSL/blob/master/README.md\">Awesome WSL</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/wsl/about\">Windows Subsystem for Linux Documentation</a></li>\n<li><a href=\"https://aka.ms/wslstore\">All WSL distributions in the Microsoft Store</a></li>\n</ul>\n",
      "title": "Remote SSH Connections to WSL2",
      "layout": "post",
      "date": "2020-03-03",
      "slug": "ssh-to-wsl2",
      "images": [
        "/images/_XLJy3h77cw.jpg"
      ],
      "thumbnail": "/images/_XLJy3h77cw-thumb.jpg",
      "credit": "https://unsplash.com/photos/_XLJy3h77cw",
      "description": "A Series on Using Windows for Open Source Development",
      "tags": [
        "windows",
        "linux",
        "open source",
        "30daywslchallenge"
      ],
      "classes": [
        "feature-hyphenate",
        "feature-justify",
        "feature-highlight"
      ],
      "categories": [
        "Linux",
        "Windows",
        "Open Source"
      ],
      "excerpt": "<p>In this article I share my learnings on remotely accessing your Windows 10 computer. My motivation was to determine efficient ways to access both the Windows environment, and the WSL2 development environment from another computer.</p>",
      "meta": {
        "relativePath": "posts/ssh-to-wsl2.html",
        "createdAt": "2020-11-05T00:10:31.920Z",
        "lastModified": "2020-11-05T00:10:31.920Z",
        "size": 8752,
        "formattedSize": "8.5 KB"
      }
    },
    {
      "id": "posts__web-assembly-and-go-a-look-to-the-future",
      "contents": "<p>It&#39;s no secret that I&#39;m resistant to learning Javascript and frontend development.  I learned HTML back before CSS was even a thing, and even Javascript came long after I started doing web development.  When I look at modern web development I shudder; the ecosystem is so confusing for someone who has been out of touch as long as I have.  Node, webpack, yarn, npm, frameworks, UMD, AMD, arghhh!</p>\n<!-- more -->\n<p>I&#39;ve been watching Web Assembly with anticipation for quite some time, with the hope that it would allow me to write web applications without the typical Javascript build process.</p>\n<p>When Web Assembly(wasm) support <a href=\"https://go-review.googlesource.com/c/go/+/102835\">landed</a> in Go recently, I knew that the time was ripe for some experimentation.  And I couldn&#39;t wait to dive in and try it.  I read a few <a href=\"https://blog.owulveryck.info/2018/06/08/some-notes-about-the-upcoming-webassembly-support-in-go.html\">good</a> <a href=\"https://docs.google.com/document/d/131vjr4DH6JFnb-blm_uRdaC0_Nv3OUwjEY5qVCxCup4/preview#heading=h.mjo1bish3xni\">articles</a> before diving in.  This post will chronicle my experience.</p>\n<p>To get started with wasm in Go you need to checkout Go from source and build it.  Web Assembly support will be released in Go 1.11, which isn&#39;t out yet.</p>\n<p>You can find instructions <a href=\"https://golang.org/doc/install/source\">here</a> on building Go from source.  Because Go requires a working <code>go</code> installation to bootstrap itself, you&#39;ll end up with two different installations of Go when you&#39;re done.  <em>Caution - this could surprise you in ways you won&#39;t like if you don&#39;t remember that you&#39;ve got two installs of Go.  I use <a href=\"http://direnv.net\">direnv</a> to manage my path for each project so I can specify which Go installation I want to use.</em></p>\n<p>After installing the latest Go, you&#39;re ready to experiment with Web Assembly.  You&#39;ll need an HTML file, and a Javascript shim to load the wasm files that you produce.  These are included in the <code>misc/wasm</code> directory of your new Go installation.  You can copy them into any new project and modify the HTML file to load your wasm output.</p>\n<p>My first project was a bit ambitious, I wanted to build something that looks roughly like a <a href=\"https://www.webcomponents.org/\">Web Component</a> in Go, compiled to Web Assembly.  I didn&#39;t get that whole thing done, because I got distracted and excited by how well everything worked.</p>\n<p>To get started, I copied the HTML and Javascript files from <code>GOROOT/misc/wasm</code> into a new directory and added a <code>main.go</code> file.  I started with the preconcieved notion that I would render my HTML into an existing node in the DOM that I declared in the HTML file.  So I created an HTML <code>section</code> tag with the ID of <code>thing</code>.</p>\n<pre><code>    &lt;section class=&quot;main&quot; id=&quot;thing&quot; &gt;Please wait...&lt;/section&gt;</code></pre><p>I inserted this right above the script tags at the bottom of the HTML file.  Next, I knew I would want to replace this node programatically, so I looked up the syntax to interact with the DOM from Go&#39;s wasm libraries.  Go added a <code>syscall/js</code> package that allows interaction with the DOM.  I got a reference to the HTML node with the ID of <code>thing</code> using this Go code:</p>\n<pre><code>    el := js.Global.Get(&quot;document&quot;).Call(&quot;getElementById&quot;, &quot;thing&quot;)</code></pre><p>Now I have a reference to the empty DOM node that I can populate with my rendered HTML.  So the next step is to actually create some HTML and stuff it in there.</p>\n<p>I used the famous TodoMVC app as my inspiration.  I started by creating two files: <code>todo.go</code> and <code>todolist.go</code>.  These files contain Go structures that represent Todo items, and a list of Todo items.</p>\n<pre><code>type Todo struct {\n    Title     string\n    Completed bool\n    //Root      js.Value\n    tree *vdom.Tree\n}\n\ntype TodoList struct {\n    Todos []Todo\n    Component\n}\n\ntype Component struct {\n    Name     string\n    Root     js.Value\n    Tree     *vdom.Tree\n    Template string\n}</code></pre><p>I also got a little cocky and started extracting things out into a <code>Component</code> type thinking that I would be embedding it in my custom types to give them Web Component functionality.  <em>I never finished this thought... you&#39;ll see why later in the article</em></p>\n<p>Each of these custom Go types has a <code>Render()</code> method and a template:</p>\n<pre><code>var todolisttemplate = `&lt;ul&gt;\n{{range $i, $x := $.Todos}} \n    {{$x.Render}} \n{{end}}\n&lt;/ul&gt;`</code></pre><pre><code>func (todoList *TodoList) Render() error {\n\n    tmpl, err := template.New(&quot;todolist&quot;).Parse(todoList.Template)\n    if err != nil {\n        return err\n    }\n    // Execute the template with the given todo and write to a buffer\n    buf := bytes.NewBuffer([]byte{})\n    if err := tmpl.Execute(buf, todoList); err != nil {\n        return err\n    }\n    // Parse the resulting html into a virtual tree\n    newTree, err := vdom.Parse(buf.Bytes())\n    if err != nil {\n        return err\n    }\n\n    if todoList.Tree != nil {\n        // Calculate the diff between this render and the last render\n        //    patches, err := vdom.Diff(todo.tree, newTree)\n}        //    if err != nil {\n        //        return err\n        //    }\n\n        // Effeciently apply changes to the actual DOM\n        //        if err := patches.Patch(todo.Root); err != nil {\n        //            return err\n        //        }\n    } else {\n\n        todoList.Tree = newTree\n    }\n    // Remember the virtual DOM state for the next render to diff against\n    todoList.Tree = newTree\n\n    todoList.Root.Set(&quot;innerHTML&quot;, string(newTree.HTML()))\n    return nil\n}</code></pre><p>My idea was that I&#39;d use the <a href=\"https://github.com/albrow/vdom\">vdom</a> package I found to do rendering so that the rendering would be more efficient.  That&#39;s where I ran into my first snag.</p>\n<h2 id=\"differences-between-gopherjs-and-gowasm\">Differences Between GopherJS and Go/wasm</h2>\n<p>The vdom package was written for <a href=\"https://gopherjs.org\">GopherJS</a> which is a transpiler from Go to Javascript.  GopherJS uses a type called <code>js.Object</code> as the base of all its conversions.  Go&#39;s new wasm library <code>syscall/js</code> uses a type called <code>js.Value</code>.  They&#39;re similar in spirit, but very different in implementation.  This meant that my vdom rendering idea was dead in the water until I ported vdom to use the new <code>js.Value</code> type instead of <code>js.Object</code>.  The vdom&#39;s <code>tree.HTML()</code> method did work without modification, though, so I was able to set the inner HTML of my HTML node to the output of the vdom&#39;s parsing.  The Render() method parses the Go struct&#39;s template, passing an instance of the Go struct as the context.  Then it uses the vdom library to create a parsed dom tree, and renders that tree in the last line of the method:</p>\n<pre><code>    todoList.Root.Set(&quot;innerHTML&quot;, string(newTree.HTML()))</code></pre><p>At this point I had a working Go/wasm prototype that didn&#39;t have any events wired up.  But it DID render to the dom and display in the browser.  That was a huge first step; I was pretty excited at this point.</p>\n<p>I built a Makefile so I wouldn&#39;t have to keep typing long build commands over and over:</p>\n<pre><code>wasm2:\n    GOROOT=~/gowasm GOARCH=wasm GOOS=js ~/gowasm/bin/go build -o example.wasm markdown.go\n\nwasm:\n    GOROOT=~/gowasm GOARCH=wasm GOOS=js ~/gowasm/bin/go build -o example.wasm .\n\nbuild-server:\n    go build -o server-app server/server.go\n\nrun: build-server wasm\n    ./server-app</code></pre><p>The make file also points out a critical problem with the state of Web Assembly today.  Modern browsers will ignore WASM files unless they&#39;re served with the proper MIME type.  <a href=\"https://blog.owulveryck.info/2018/06/08/some-notes-about-the-upcoming-webassembly-support-in-go.html\">This article</a> had a simple HTTP file server that sets the right MIME type for web assembly files.  I copied it into my project and use it to serve the app.  If your web server does the right thing for <code>.wasm</code> files, you don&#39;t need a custom server.</p>\n<h3 id=\"nerd-sniped\">Nerd Sniped</h3>\n<p>It was at this point that I realized that Web Assembly worked really well, and maybe more importantly: much of the code for GopherJS would work with little or no modifications in Web Assembly.  I <a href=\"https://xkcd.com/356/\">nerd sniped</a> myself.  The next thing I attempted was to take a <a href=\"https://github.com/gopherjs/vecty\">vecty</a> application and compile it.  It failed pretty hard because vecty is written for GopherJS, and uses the <code>js.Object</code> types instead of <code>js.Value</code>.  I <a href=\"https://github.com/gowasm/vecty\">forked vecty</a> and made some modifications, some hacks, and commented out too much code to make vecty compile in wasm.</p>\n<p>The end result was that the live markdown editor in the <code>vecty/examples</code> folder runs beautifully in Web Assembly.  This post is getting a little wordy, so I&#39;ll let you read the source <a href=\"https://github.com/bketelsen/wasmplay/tree/master/markdownvecty\">here</a>. TL;DR: it&#39;s almost exactly the same as the GopherJS version, but web assembly exits when main() exits, so I added an empty channel receive at the end of main() to prevent the exit and keep the app running.</p>\n<h3 id=\"events\">Events</h3>\n<p><code>syscall/js</code> in Go uses a very different method of registering events.  I had to modify vecty&#39;s <a href=\"https://github.com/gowasm/vecty/blob/wasm-wip/dom.go#L231\">event registration</a> code to use the new wasm method of callback registration.  It took me far too long to figure this out, but it works really well now.</p>\n<h3 id=\"conclusion\">Conclusion</h3>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">2005: Rails<br>2010: Go<br>2013: Docker <br>2018: Web assembly is going to democratize the frontend.  I&#39;m predicting that in 2 years or less, Go, Swift, Rust will be 1/3 of the frontend code</p>&mdash; Brian Ketelsen (@bketelsen) <a href=\"https://twitter.com/bketelsen/status/1009989486346948608?ref_src=twsrc%5Etfw\">June 22, 2018</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>After playing with this for a few hours over the course of several evenings, I&#39;ve decided that Web Assembly is the future of web development.  It enables any language that can compile to wasm to be a &quot;frontend&quot; language.  That&#39;s huge for old people like me who never really wanted to get into the Javascript ecosystem, and it&#39;s huge for all the languages that aren&#39;t Javascript. </p>\n<p><em>You can find the source code for these demo applications <a href=\"https://github.com/bketelsen/wasmplay\">here</a>.  Use at your own risk, it may destroy your computer, and it&#39;s definitely hacky code!</em> </p>\n<blockquote>\n<p>Image Credit <a href=\"https://webassembly.org/\">webassembly.org</a>\n<a href=\"https://gopherjs.org\">GopherJS</a>\n<a href=\"https://github.com/gopherjs/vecty\">Vecty</a></p>\n<p>GopherJS and Vecty are open source projects created by @neelance, @slimsag and many others.</p>\n</blockquote>\n",
      "author": "Brian Ketelsen",
      "categories": [
        "wasm",
        "web",
        "go",
        "javascript"
      ],
      "date": "2018-06-22T16:17:21Z",
      "description": "",
      "images": [
        "/images/2018/06/612px-Web_Assembly_Logo.svg.png"
      ],
      "slug": "web-assembly-and-go-a-look-to-the-futurs",
      "tags": [
        "wasm",
        "web",
        "go",
        "javascript"
      ],
      "title": "Web Assembly and Go: A look to the future",
      "excerpt": "<p>It&apos;s no secret that I&apos;m resistant to learning Javascript and frontend development.  I learned HTML back before CSS was even a thing, and even Javascript came long after I started doing web development.  When I look at modern web development I shudder; the ecosystem is so confusing for someone who has been out of touch as long as I have.  Node, webpack, yarn, npm, frameworks, UMD, AMD, arghhh!</p>",
      "meta": {
        "relativePath": "posts/web-assembly-and-go-a-look-to-the-future.html",
        "createdAt": "2020-11-05T00:11:23.030Z",
        "lastModified": "2020-11-05T00:11:23.030Z",
        "size": 10578,
        "formattedSize": "10.3 KB"
      }
    },
    {
      "id": "posts__win-the-dev-box",
      "contents": "<p>I&#39;ve long used macOS or Linux when I make my Open Source contributions, but I think that the time is right to try Windows as a full-time development environment.  If you want to jump on board, this article series is for you!</p>\n<!-- more -->\n\n<h2 id=\"a-guide-for-open-source-developers-moving-to-windows\">A Guide for Open Source Developers Moving To Windows</h2>\n<p>In this first article we&#39;ll start with the installation and configuration of the Windows Subsystem for Linux, and get you to the point where you can clone and compile/run your OSS projects.</p>\n<p>The series will continue with other articles and advice on using Windows as your daily driver if you&#39;re used to macOS or Linux desktops.</p>\n<h3 id=\"preface\">Preface</h3>\n<p>In a discussion with <a href=\"https://twitter.com/robconery\">Rob Conery</a> I made the bold statement that with the addition of the <a href=\"https://docs.microsoft.com/en-us/windows/wsl/wsl2-about\">Windows Subsystem for Linux 2(WSL2)</a> there were no blockers for the average Open Source developer to use Windows as a daily driver.</p>\n<p>To put my money where my mouth is, I&#39;ve (personally) purchased a <a href=\"https://www.microsoft.com/en-us/surface/business/surface-laptop-3\">Surface Laptop 3</a>, and I&#39;m going to use it as my daily workhorse for the next 30 days.  We&#39;ll call it the #30DayWSLChallenge.</p>\n<p>Find other articles in this series <a href=\"/tags/30daywslchallenge/\">with this link</a>.</p>\n<h3 id=\"assumptions\">Assumptions</h3>\n<p><em>This guide is for you if you&#39;re traditionally a macOS or Linux desktop user and you&#39;re looking for information on how to use a Windows 10 device with Windows Subsystem for Linux as your primary development environment.</em></p>\n<ul>\n<li>I’m assuming you’re coming from a *Nix system like MacOS or a Linux distribution</li>\n<li>I’m assuming you’re looking for a setup on Windows that feels like the dev environment that you already have</li>\n<li>I’m assuming that you’re familiar with the bash or zsh shell, and have basic skills on the command line</li>\n<li>I&#39;m assuming that you&#39;re open minded enough to stay with the switch beyond the first few days of discomfort with something new</li>\n</ul>\n<h2 id=\"getting-started\">Getting Started</h2>\n<p>As an open source developer, almost all the projects I work on are best developed on Linux.  My goal in this guide is to set up a modern Windows 10 environment that rivals the development experience on Linux while providing the comforts of a mainstream operating system.  And by &quot;comforts&quot; I mean things like working audio, long battery life, and stable office suites.  Linux has come a <em>long</em> way, but it&#39;s still hard to make it a daily driver for most people.</p>\n<h2 id=\"installation\">Installation</h2>\n<p>After unboxing your new laptop the first thing to do is rename it.  Windows comes with a randomly generated host name by default.  Yuck!</p>\n<ul>\n<li>Rename your PC</li>\n</ul>\n<p><code>Desktop-R4NDH3X</code> isn&#39;t my speed.  When it asks you to reboot, you can choose the &quot;later&quot; option, we have plenty of rebooting coming up.  </p>\n<p>Go to <code>Start &gt; Settings &gt; System &gt; About</code> and click the <code>Rename this PC</code> button.  I like to name my computers after <a href=\"https://dune.fandom.com/wiki/Category:Planets\">planets in the Dune series of novels</a>, but you do you...</p>\n<p><img src=\"/images/wsl/renamepc.jpg\" alt=\"Rename PC\"></p>\n<ul>\n<li>Move to Windows Insider to get beta builds.  </li>\n</ul>\n<p>Open the Start Menu, then choose Settings, then Update &amp; Security</p>\n<p><img src=\"/images/wsl/insider.png\" alt=\"Insider\"></p>\n<p>Add or link an account, and set up <a href=\"https://insider.windows.com/en-us/\">Windows Insider</a> preferences to be either <a href=\"https://insider.windows.com/en-us/how-to-pc/#about-rings\">&quot;Slow Ring&quot; or &quot;Fast Ring&quot;</a> to enable WSL2.  Enabling Windows Insider will require a reboot.  Slow ring is the minimum required for WSL2 (build 18917 or higher), Fast ring has all the latest features and potentially some bugs that could prevent you from being productive.  Use your judgement to choose which to install based on your tolerance for risk.</p>\n<ul>\n<li>Windows Update</li>\n</ul>\n<p>Now go into Windows Update and get the updates.   One of them will be the version that enables WSL2.  When all your updates are installed you can proceed.</p>\n<ul>\n<li>Install the new Microsoft Edge (optional, but awesome)</li>\n</ul>\n<p>Head to the <a href=\"https://www.microsoft.com/en-us/edge\">edge download site</a> and install the new version of Microsoft Edge.  It&#39;s based on Chromium and a lot nicer than the older Edge.  Be sure to checkout the multiple profile support.  I have profiles for different contexts (work, banking, personal) and really enjoy the separation of cookies.</p>\n<p>It will be automatically installed after an update or two, so this isn&#39;t critical, but it&#39;s nice to get it out of the way up front.</p>\n<ul>\n<li>Install the features to enable <a href=\"https://docs.microsoft.com/en-us/windows/wsl/wsl2-install\">WSL2</a></li>\n</ul>\n<p>Open PowerShell as an Administrator:</p>\n<p><img src=\"/images/wsl/wsl-powershell-admin.png\" alt=\"Elevated Access Powershell\"></p>\n<p>run these two commands:</p>\n<pre><code>dism.exe /online /enable-feature /featurename:Microsoft-Windows-Subsystem-Linux /all /norestart\n\ndism.exe /online /enable-feature /featurename:VirtualMachinePlatform /all /norestart</code></pre><p>This enables the Virtual Machine Platform, which gives us the hypervisor from HyperV without installing HyperV. It is also available on Windows 10 Home, which has previously been a blocker for developers who want to run Docker, etc, on Windows 10 Home edition.</p>\n<ul>\n<li>Microsoft Store</li>\n</ul>\n<p>Open the Microsoft Store app and install any updates that are pending.  If you want to use X11 applications from WSL you&#39;ll need an X server too.  I use <a href=\"https://token2shell.com/x410/\">X410</a> and heartily endorse the purchase if you can catch it ON SALE, like it is now for $9.99 US.  Don&#39;t pay full price though, there are others that are available if X410 isn&#39;t on sale.</p>\n<p>Install <a href=\"https://www.microsoft.com/store/productId/9NBLGGH4MSV6\">Ubuntu</a> from the Microsoft Store.  Don&#39;t pick a versioned app, just choose the <code>Ubuntu</code> app without a version.  It follows LTS.</p>\n<p><img src=\"/images/wsl/microsoft-store-ubuntu.png\" alt=\"Ubuntu\"></p>\n<p>Let&#39;s and make WSL 2 our <em>default</em> per the <a href=\"https://docs.microsoft.com/en-us/windows/wsl/wsl2-install\">Installation Instructions for WSL 2</a>. If we don&#39;t do this we risk running WSL 1 accidentally and WSL 2 has <em>much</em> better performance. Let&#39;s open a terminal and run:</p>\n<pre><code>wsl --set-default-version 2</code></pre><p>Install <a href=\"https://www.microsoft.com/store/productId/9N0DX20HK701\">Windows Terminal</a>.  The new Windows Terminal is a solid terminal emulator, and you&#39;ll feel at home here if you&#39;re used to iTerm2 or Gnome Terminal.  I didn&#39;t mark this as optional, because you&#39;re used to using a real terminal, and Windows Terminal is the only thing that will satisfy you.  Trust me on this.</p>\n<p><img src=\"/images/wsl/windows-terminal.png\" alt=\"Windows Terminal\"></p>\n<ul>\n<li>Open the <code>Ubuntu</code> app from your Start menu</li>\n</ul>\n<p><img src=\"/images/wsl/wsl-first-run.png\" alt=\"ubuntu\"></p>\n<p>After a moment, it will ask for a username and password.  These are your credentials inside the Linux world.  You can choose any *nix friendly username.</p>\n<p><img src=\"/images/wsl/wsl-success.png\" alt=\"success\"></p>\n<ul>\n<li>Download and install Visual Studio Code</li>\n</ul>\n<p>Go to <a href=\"https://code.visualstudio.com/Download\">the VS Code website</a> and download it.  Install it when the download is complete.</p>\n<ul>\n<li>Pin VS Code and Windows Terminal to your start menu (and maybe your taskbar)</li>\n</ul>\n<p><img src=\"/images/wsl/pintostart.png\" alt=\"pin\"></p>\n<ul>\n<li>Install the Remote WSL extension in Visual Studio Code which is part of the <a href=\"https://code.visualstudio.com/docs/remote/remote-overview#_remote-development-extension-pack\">VS Code Remote Development extension pack</a></li>\n</ul>\n<p><img src=\"/images/wsl/vscode-remote-extensionpack.png\" alt=\"remote\"></p>\n<ul>\n<li>Configure Windows Terminal</li>\n</ul>\n<p>Open Windows Terminal, then click the &quot;down arrow&quot; next to the new tab button.  Choose &quot;Settings&quot;.</p>\n<p>Find the stanza with your &quot;Ubuntu&quot; installation and copy the <code>guid</code>.  Paste it into the value for &quot;defaultProfile&quot; at the top of the settings file.</p>\n<p><img src=\"/images/wsl/terminal-default-profile.png\" alt=\"default\"></p>\n<p>While you&#39;re in there, download <a href=\"https://github.com/microsoft/cascadia-code/releases\">Cascadia Code PL</a> and install it (by double-clicking on the ttf file).  Edit your &quot;Ubuntu&quot; profile in the Windows Terminal settings to use the new font:</p>\n<pre><code>    {\n            &quot;guid&quot;: &quot;{2c4de342-38b7-51cf-b940-2309a097f518}&quot;,\n            &quot;hidden&quot;: false,\n            &quot;name&quot;: &quot;Ubuntu&quot;,\n            &quot;source&quot;: &quot;Windows.Terminal.Wsl&quot;,\n            &quot;startingDirectory&quot;: &quot;//wsl$/Ubuntu/home/YOURUSER&quot;,\n            &quot;fontFace&quot;: &quot;Cascadia Code PL&quot;,\n            &quot;fontSize&quot;: 12,\n        },</code></pre><p>Finally, change your starting directory too, by modifying the &quot;startingDirectory&quot; value.  Change <code>YOURUSER</code> to the username you chose when you installed WSL.  Mine was <code>bjk</code>.  If you don&#39;t do this, WSL will start up in your Windows User profile directory, which will be mighty confusing since it&#39;s not <code>$HOME</code>.</p>\n<h3 id=\"sidebar\">Sidebar</h3>\n<p>In the last step we set the starting directory for Windows Terminal&#39;s Ubuntu instance to <code>//wsl$/Ubuntu/home/bjk</code>.  This is an awesome little trick you can use from the Windows side of things to browse your WSL file system.   Sometimes Windows Explorer is much easier than using some bash commands to move files around.  Speaking of bash commands, by default your <code>C:\\</code> drive is mounted in WSL at <code>/mnt/c</code>.  How awesome is that?  You can do all kinds of crazy things using these interop tricks.  See the references and links below for more.</p>\n<p>To navigate there directly enter <code>\\\\wsl$</code> in the address bar of Windows Explorer:</p>\n<p><img src=\"/images/wsl/explorer-integration.png\" alt=\"Windows Explorer\"></p>\n<h3 id=\"continuing-on\">Continuing On...</h3>\n<ul>\n<li>Install your dotfiles</li>\n</ul>\n<p>Mine are on <a href=\"https://github.com/bketelsen/dotfiles\">Github</a>.  I created a <code>git.io</code> shortcut so I could curl | bash install them.  Install yours however you&#39;re accustomed.  If you&#39;re searching for options, I am enjoying <a href=\"https://github.com/twpayne/chezmoi\">chezmoi</a> these days, my repo is a good starting point, showing how you can do different installation tasks by operating system.</p>\n<p>Note that WSL is just Linux, Ubuntu to be precise (get that??).  You shouldn&#39;t have to modify anything if your dotfiles are already Linux-friendly.</p>\n<h3 id=\"docker\">Docker</h3>\n<p>Recently <a href=\"https://docs.docker.com/docker-for-windows/wsl-tech-preview/\">Docker announced</a> a version of Docker Desktop that works very nicely with both the Windows and WSL sides of your development.  Impressive reading in that link if you&#39;re interested in the technical details.  Follow the directions in that link to install and enable WSL2-friendly Docker Desktop.</p>\n<p><img src=\"/images/docker-two-sides.png\" alt=\"Docker from Both Sides\"></p>\n<p>You can even just <a href=\"https://docs.docker.com/install/linux/docker-ce/ubuntu/\">install Docker Engine - Community for Ubuntu</a> right inside WSL, if you prefer.</p>\n<p>Finally, once we have WSL setup the way we&#39;d like, we can export and import our distro(s) to or from a tar file using the <a href=\"https://docs.microsoft.com/en-us/windows/wsl/reference#arguments-for-managing-windows-subsystem-for-linux\">following commands</a>:</p>\n<pre><code>wsl --export &lt;Distro&gt; &lt;FileName&gt;\n\nwsl --import &lt;Distro&gt; &lt;InstallLocation&gt; &lt;FileName&gt;</code></pre><p>This allows you to move a WSL installation to a new computer if necessary, or just keep a backup somewhere safe.</p>\n<h3 id=\"integrations\">Integrations</h3>\n<p>If you&#39;re in the terminal in a directory you want to edit, you can type <code>code .</code>, which will open Visual Studio Code on the Windows side (!! right?? !!) and install the &quot;Remote WSL&quot; extension for you.  Crazy awesome stuff.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>From here you are ready to clone a repo and start making changes.  Follow along <a href=\"/tags/30daywslchallenge/\">here</a> as I add more tips and tricks that I discover on my journey to reduce the number of physical and virtual computers required to do my job.</p>\n<h2 id=\"references-and-further-information\">References and Further Information</h2>\n<ul>\n<li><a href=\"https://wsl.dev\">WSL Tips and Tricks</a></li>\n<li><a href=\"https://github.com/sirredbeard/Awesome-WSL/blob/master/README.md\">Awesome WSL</a></li>\n<li><a href=\"https://docs.microsoft.com/en-us/windows/wsl/about\">Windows Subsystem for Linux Documentation</a></li>\n<li><a href=\"https://aka.ms/wslstore\">All WSL distributions in the Microsoft Store</a></li>\n</ul>\n",
      "title": "Windows for Open Source Development",
      "layout": "post",
      "date": "2020-02-24",
      "slug": "windows-for-open-source-development",
      "images": [
        "/images/h3GAGi5tXMU.jpg"
      ],
      "thumbnail": "/images/h3GAGi5tXMU-thumb.jpg",
      "credit": "https://unsplash.com/photos/h3GAGi5tXMU",
      "description": "A Series on Using Windows for Open Source Development",
      "tags": [
        "windows",
        "linux",
        "open source",
        "30daywslchallenge"
      ],
      "classes": [
        "feature-hyphenate",
        "feature-justify",
        "feature-highlight"
      ],
      "categories": [
        "Linux",
        "Windows",
        "Open Source"
      ],
      "excerpt": "<p>I&apos;ve long used macOS or Linux when I make my Open Source contributions, but I think that the time is right to try Windows as a full-time development environment.  If you want to jump on board, this article series is for you!</p>",
      "meta": {
        "relativePath": "posts/win-the-dev-box.html",
        "createdAt": "2020-11-05T00:11:39.200Z",
        "lastModified": "2020-11-05T00:11:39.200Z",
        "size": 12222,
        "formattedSize": "11.9 KB"
      }
    }
  ]
}
